include("parameters.jl")
using .parameters

include("bubble_gen_ini.jl")
using .bubbles

const USE_GPU = true
using ImplicitGlobalGrid
import MPI
using ParallelStencil
using ParallelStencil.FiniteDifferences3D
using StatsBase
using Random
# using CUDA
using Plots
using NPZ

include("random_ini_gen.jl")
using .randomizer

include("macros.jl")
using .compute_macros

#using Plots
#pythonplot()

@static if USE_GPU
    @init_parallel_stencil(CUDA, Float64, 3);
else
    @init_parallel_stencil(Threads, Float64, 3);
end

@parallel function diffusion3D_step!(T2, T, Ci, lam, dt, dx, dy, dz)
    @inn(T2) = @inn(T) + dt*(lam*@inn(Ci)*(@d2_xi(T)/dx^2 + @d2_yi(T)/dy^2 + @d2_zi(T)/dz^2));
    return
end

#Issues with too many variables
#one solution would be to break the system into 2 pairs: 1 updates the fields f and the other updates the fdot
#This was one can reduce the number of variables passed to the kernel
#works after removing the unused variables: max tested was 79 that worked. did not work for 105
#need to look into cleaning up and removing the time components of the gauge fields from the code in 
# its entirety for the choice of gauge

#Initial condition setup in serial code is painfull slow
#Worked out a parallel implementation
#Seems to be fine. Need to test against analytical

@parallel function evolve!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    Γ_1_n,Γ_2_n,Γ_3_n,Σ_n,
    gw,gy,gp2,lambda,vev,dx,dt)
    
    # @inn(test_arr) = @inn(dϕ_1_dt).+gw*@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    # W_1_1,W_1_2,W_1_3,W_1_4,
    # W_2_1,W_2_2,W_2_3,W_2_4,
    # W_3_1,W_3_2,W_3_3,W_3_4,
    # Y_1,Y_2,Y_3,Y_4)
    # @inn(ϕ_1_n) = @inn(ϕ_1) .+ dt.*(@d2_xi(ϕ_1) .+@d2_yi(ϕ_1) .+@d2_zi(ϕ_1))
    @inn(ϕ_1_n) = @inn(ϕ_1) .+ dt.*( @d2_xi(ϕ_1)./(dx*dx) .+@d2_yi(ϕ_1)./(dx*dx) .+@d2_zi(ϕ_1)./(dx*dx) .-
    0.5*gw.*((-@inn(W_1_2).*@d_xi(ϕ_4)./dx.-@inn(W_1_3).*@d_yi(ϕ_4)./dx.-@inn(W_1_4).*@d_zi(ϕ_4)./dx).-
    (-@inn(W_2_2).*@d_xi(ϕ_3)./dx.-@inn(W_2_3).*@d_yi(ϕ_3)./dx.-@inn(W_2_4).*@d_zi(ϕ_3)./dx).+
    (-@inn(W_3_2).*@d_xi(ϕ_2)./dx.-@inn(W_3_3).*@d_yi(ϕ_2)./dx.-@inn(W_3_4).*@d_zi(ϕ_2)./dx)).-
    0.5*gy.*(-@inn(Y_2).*@d_xi(ϕ_2)./dx.-@inn(Y_3).*@d_yi(ϕ_2)./dx.-@inn(Y_4).*@d_zi(ϕ_2)./dx).-
    0.5*gw.*((-@inn(W_1_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_4).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    (-@inn(W_2_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_3).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).+
    (-@inn(W_3_2).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)))).-
    0.5*gy.*(-@inn(Y_2).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    2.0*lambda.*((@inn(ϕ_1).*@inn(ϕ_1)) .+(@inn(ϕ_2).*@inn(ϕ_2)) .+(@inn(ϕ_3).*@inn(ϕ_3)) .+(@inn(ϕ_4).*@inn(ϕ_4)) .-vev*vev).*@inn(ϕ_1).+
    0.5 .*((gw.*@inn(Γ_3) .+gy.*@inn(Σ)).*@inn(ϕ_2).-gw.*@inn(Γ_2) .*@inn(ϕ_3).+gw.*@inn(Γ_1).*@inn(ϕ_4)))

    @inn(ϕ_2_n) =@inn(ϕ_2) .+ dt.*(@d2_xi(ϕ_2)./(dx*dx) .+@d2_yi(ϕ_2)./(dx*dx) .+@d2_zi(ϕ_2)./(dx*dx) .+
    0.5*gw.*((-@inn(W_1_2).*@d_xi(ϕ_3)./dx.-@inn(W_1_3).*@d_yi(ϕ_3)./dx.-@inn(W_1_4).*@d_zi(ϕ_3)./dx).+
    (-@inn(W_2_2).*@d_xi(ϕ_4)./dx.-@inn(W_2_3).*@d_yi(ϕ_4)./dx.-@inn(W_2_4).*@d_zi(ϕ_4)./dx).+
    (-@inn(W_3_2).*@d_xi(ϕ_1)./dx.-@inn(W_3_3).*@d_yi(ϕ_1)./dx.-@inn(W_3_4).*@d_zi(ϕ_1)./dx)).+
    0.5.*gy.*(-@inn(Y_2).*@d_xi(ϕ_1)./dx.-@inn(Y_3).*@d_yi(ϕ_1)./dx.-@inn(Y_4).*@d_zi(ϕ_1)./dx).+
    0.5.*gw.*((-@inn(W_1_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_3).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).+
    (-@inn(W_2_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_4).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).+
    (-@inn(W_3_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)))).+
    0.5.*gy.*(-@inn(Y_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    2.0.*lambda.*((@inn(ϕ_1).*@inn(ϕ_1)) .+(@inn(ϕ_2).*@inn(ϕ_2)) .+(@inn(ϕ_3).*@inn(ϕ_3)) .+(@inn(ϕ_4).*@inn(ϕ_4)) .-vev*vev)*@inn(ϕ_2).-
    0.5 .*((gw*@inn(Γ_3) .+gy.*@inn(Σ)) .*@inn(ϕ_1) .+gw .*@inn(Γ_1).*@inn(ϕ_3) .+gw.*@inn(Γ_2) .*@inn(ϕ_4)))

    @inn(ϕ_3_n) =@inn(ϕ_3) .+ dt.*(@d2_xi(ϕ_3)./(dx*dx) .+@d2_yi(ϕ_3)./(dx*dx) .+@d2_zi(ϕ_3)./(dx*dx) .-
    0.5*gw.*((-@inn(W_1_2).*@d_xi(ϕ_2)./dx.-@inn(W_1_3).*@d_yi(ϕ_2)./dx.-@inn(W_1_4).*@d_zi(ϕ_2)./dx).+
    (-@inn(W_2_2).*@d_xi(ϕ_1)./dx.-@inn(W_2_3).*@d_yi(ϕ_1)./dx.-@inn(W_2_4).*@d_zi(ϕ_1)./dx).-
    (-@inn(W_3_2).*@d_xi(ϕ_4)./dx.-@inn(W_3_3).*@d_yi(ϕ_4)./dx.-@inn(W_3_4).*@d_zi(ϕ_4)./dx)).-
    0.5.*gy.*(-@inn(Y_2).*@d_xi(ϕ_4)./dx.-@inn(Y_3).*@d_yi(ϕ_4)./dx.-@inn(Y_4).*@d_zi(ϕ_4)./dx).-
    0.5.*gw.*((-@inn(W_1_2).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).+
    (-@inn(W_2_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    (-@inn(W_3_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_4).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)))).-
    0.5.*gy.*(-@inn(Y_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_4).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    2.0.*lambda.*((@inn(ϕ_1).*@inn(ϕ_1)) .+(@inn(ϕ_2).*@inn(ϕ_2)) .+(@inn(ϕ_3).*@inn(ϕ_3)) .+(@inn(ϕ_4).*@inn(ϕ_4)) .-vev*vev).*@inn(ϕ_3).+
    0.5 .*((-gw.*@inn(Γ_3) .+gy*@inn(Σ))*@inn(ϕ_4).+gw .*@inn(Γ_2) .*@inn(ϕ_1).+gw .*@inn(Γ_1) .*@inn(ϕ_2)))

    @inn(ϕ_4_n) =@inn(ϕ_4) .+ dt.*(@d2_xi(ϕ_4)./(dx*dx) .+@d2_yi(ϕ_4)./(dx*dx) .+@d2_zi(ϕ_4)./(dx*dx) .+
    0.5.*gw.*((-@inn(W_1_2).*@d_xi(ϕ_1)./dx.-@inn(W_1_3).*@d_yi(ϕ_1)./dx.-@inn(W_1_4).*@d_zi(ϕ_1)./dx).-
    (-@inn(W_2_2).*@d_xi(ϕ_2)./dx.-@inn(W_2_3).*@d_yi(ϕ_2)./dx.-@inn(W_2_4).*@d_zi(ϕ_2)./dx).-
    (-@inn(W_3_2).*@d_xi(ϕ_3)./dx.-@inn(W_3_3).*@d_yi(ϕ_3)./dx.-@inn(W_3_4).*@d_zi(ϕ_3)./dx)).+
    0.5.*gy.*(-@inn(Y_2).*@d_xi(ϕ_3)./dx.-@inn(Y_3).*@d_yi(ϕ_3)./dx.-@inn(Y_4).*@d_zi(ϕ_3)./dx).+
    0.5.*gw.*((-@inn(W_1_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    (-@inn(W_2_2).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    (-@inn(W_3_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_3).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)))).+
    0.5.*gy.*(-@inn(Y_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_3).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    2.0.*lambda.*((@inn(ϕ_1).*@inn(ϕ_1)) .+(@inn(ϕ_2).*@inn(ϕ_2)) .+(@inn(ϕ_3).*@inn(ϕ_3)) .+(@inn(ϕ_4).*@inn(ϕ_4)) .-vev.*vev).*@inn(ϕ_4).-
    0.5 .*((-gw .*@inn(Γ_3) .+gy.*@inn(Σ)).*@inn(ϕ_3).+gw.*@inn(Γ_1) .*@inn(ϕ_1).-gw.*@inn(Γ_2) .*@inn(ϕ_2)))

    # c W.-fluxes:
    # c
    # r(W_1_1)=0.

    # r(W_1_2)= 
    @inn(W_1_2_n) =@inn(W_1_2).+dt.*(@d2_xi(W_1_2)./(dx*dx) .+@d2_yi(W_1_2)./(dx*dx) .+@d2_zi(W_1_2)./(dx*dx) .+gw.*( 
        -(@d_xi(W_2_2)./dx.*@inn(W_3_2).-@d_xi(W_3_2)./dx.*@inn(W_2_2)).-
        (@d_yi(W_2_2)./dx.*@inn(W_3_3).-@d_yi(W_3_2)./dx.*@inn(W_2_3)).-
        (@d_zi(W_2_2)./dx.*@inn(W_3_4).-@d_zi(W_3_2)./dx.*@inn(W_2_4)).-
        # .-(@inn(W_2_2).*fs[3,2,2].-@inn(W_3_2).*fs[2,2,2])
        (@inn(W_2_3).*( @d_xi(W_3_3)./dx .- @d_yi(W_3_2)./dx .+ gw.*( @inn(W_1_2) .*@inn(W_2_3) .- @inn(W_1_3).*@inn(W_2_2) )).-
        @inn(W_3_3).*( @d_xi(W_2_3)./dx .-@d_yi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_3) .- @inn(W_3_3).*@inn(W_1_2) ))).-
        (@inn(W_2_4).*( @d_xi(W_3_4)./dx .-@d_zi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_2) )).-
        @inn(W_3_4).*( @d_xi(W_2_4)./dx .-@d_zi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_2) )))
        ).+
    # c current from Higgs:
        gw.*(@inn(ϕ_1).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    # c gauge fixing terms:
        @d_xi(Γ_1)./dx .-gw.*(@inn(W_2_2).*@inn(Γ_3).-@inn(W_3_2).*@inn(Γ_2)).-
# c new terms in Num. Rel. method (though we have chosen
# c @inn(W_1_1)=0=@inn(W_2_1)=@inn(W_3_1) so these terms don't play a role here).:
        gw.*(@inn(W_2_1).*( @inn(dW_3_2_dt) ).-
        @inn(W_3_1).*( @inn(dW_2_2_dt) )))

    # r(W_1_3)=
    @inn(W_1_3_n) =@inn(W_1_3).+dt.*(@d2_xi(W_1_3)./(dx*dx) .+@d2_yi(W_1_3)./(dx*dx) .+@d2_zi(W_1_3)./(dx*dx) .+gw.*( 
        -(@d_xi(W_2_3)./dx.*@inn(W_3_2).-@d_xi(W_3_3)./dx.*@inn(W_2_2)).-
        (@d_yi(W_2_3)./dx.*@inn(W_3_3).-@d_yi(W_3_3)./dx.*@inn(W_2_3)).-
        (@d_zi(W_2_3)./dx.*@inn(W_3_4).-@d_zi(W_3_3)./dx.*@inn(W_2_4)).-
        (@inn(W_2_2).*-( @d_xi(W_3_3)./dx .- @d_yi(W_3_2)./dx .+ gw.*( @inn(W_1_2) .*@inn(W_2_3) .- @inn(W_1_3).*@inn(W_2_2) )).-
        @inn(W_3_2).*-( @d_xi(W_2_3)./dx .-@d_yi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_3) .- @inn(W_3_3).*@inn(W_1_2) ))).-
        # .-(@inn(W_2_3).*fs[3,3,3].-@inn(W_3_3).*fs[2,3,3])
        (@inn(W_2_4).*( @d_xi(W_3_4)./dx .-@d_zi(W_3_3)./dx .+gw.*( @inn(W_1_3) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_3) )).-
        @inn(W_3_4).*( @d_yi(W_2_4)./dx .-@d_zi(W_2_3)./dx .+gw.*( @inn(W_3_3) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_3) )))
        ).+
        gw.*(@inn(ϕ_1).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_yi(Γ_1)./dx .-gw.*(@inn(W_2_3).*@inn(Γ_3).-@inn(W_3_3).*@inn(Γ_2)).-
        gw.*(@inn(W_2_1).*( @inn(dW_3_3_dt) ).-
        @inn(W_3_1).*( @inn(dW_2_3_dt) )))

    # r(W_1_4)=
    @inn(W_1_4_n) =@inn(W_1_4).+dt.*(@d2_xi(W_1_4)./(dx*dx) .+@d2_yi(W_1_4)./(dx*dx) .+@d2_zi(W_1_4)./(dx*dx) .+gw.*( 
        -(@d_xi(W_2_4)./dx.*@inn(W_3_2).-@d_xi(W_3_4)./dx.*@inn(W_2_2)).-
        (@d_yi(W_2_4)./dx.*@inn(W_3_3).-@d_yi(W_3_4)./dx.*@inn(W_2_3)).-
        (@d_zi(W_2_4)./dx.*@inn(W_3_4).-@d_zi(W_3_4)./dx.*@inn(W_2_4)).-
        (@inn(W_2_2).*-( @d_xi(W_3_4)./dx .-@d_zi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_2) )).-
        @inn(W_3_2).*-( @d_xi(W_2_4)./dx .-@d_zi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_2) ))).-
        (@inn(W_2_3).*-( @d_xi(W_3_4)./dx .-@d_zi(W_3_3)./dx .+gw.*( @inn(W_1_3) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_3) )).-
        @inn(W_3_3).*-( @d_yi(W_2_4)./dx .-@d_zi(W_2_3)./dx .+gw.*( @inn(W_3_3) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_3) )))
        # .-(@inn(W_2_4).*fs[3,4,4].-@inn(W_3_4).*fs[2,4,4])
        ).+
        gw.*(@inn(ϕ_1).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_zi(Γ_1)./dx .-gw.*(@inn(W_2_4).*@inn(Γ_3).-@inn(W_3_4).*@inn(Γ_2)).-
        gw.*(@inn(W_2_1).*( @inn(dW_3_4_dt) ).-
        @inn(W_3_1).*( @inn(dW_2_4_dt) )))

    # r(W_2_1)=0.

    # r(W_2_2)=
    @inn(W_2_2_n) =@inn(W_2_2).+dt.*(@d2_xi(W_2_2)./(dx*dx) .+@d2_yi(W_2_2)./(dx*dx) .+@d2_zi(W_2_2)./(dx*dx) .+gw.*( 
        -(@d_xi(W_3_2)./dx.*@inn(W_1_2).-@d_xi(W_1_2)./dx.*@inn(W_3_2)).-
        (@d_yi(W_3_2)./dx.*@inn(W_1_3).-@d_yi(W_1_2)./dx.*@inn(W_3_3)).-
        (@d_zi(W_3_2)./dx.*@inn(W_1_4).-@d_zi(W_1_2)./dx.*@inn(W_3_4)).-
        # .-(@inn(W_3_2).*fs[1,2,2].-@inn(W_1_2).*fs[3,2,2])
        (@inn(W_3_3).*( @d_xi(W_1_3)./dx .-@d_yi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_3) .- @inn(W_2_3).*@inn(W_3_2) )).-
        @inn(W_1_3).*( @d_xi(W_3_3)./dx .-@d_yi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_3) .- @inn(W_1_3).*@inn(W_2_2) ))).-
        (@inn(W_3_4).*( @d_xi(W_1_4)./dx .-@d_zi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_2) )).-
        @inn(W_1_4).*( @d_xi(W_3_4)./dx .-@d_zi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_2) )))
        ).+
        gw.*(-@inn(ϕ_1).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_xi(Γ_2)./dx .-gw.*(@inn(W_3_2).*@inn(Γ_1).-@inn(W_1_2).*@inn(Γ_3)).-
        gw.*(@inn(W_3_1).*( @inn(dW_1_2_dt) ).-
        @inn(W_1_1).*( @inn(dW_3_2_dt) )))

    # r(W_2_3)=
    @inn(W_2_3_n) =@inn(W_2_3).+dt.*(@d2_xi(W_2_3)./(dx*dx) .+@d2_yi(W_2_3)./(dx*dx) .+@d2_zi(W_2_3)./(dx*dx) .+gw.*( 
        -(@d_xi(W_3_3)./dx.*@inn(W_1_2).-@d_xi(W_1_3)./dx.*@inn(W_3_2)).-
        (@d_yi(W_3_3)./dx.*@inn(W_1_3).-@d_yi(W_1_3)./dx.*@inn(W_3_3)).-
        (@d_zi(W_3_3)./dx.*@inn(W_1_4).-@d_zi(W_1_3)./dx.*@inn(W_3_4)).-
        (@inn(W_3_2).*-( @d_xi(W_1_3)./dx .-@d_yi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_3) .- @inn(W_2_3).*@inn(W_3_2) )).-
        @inn(W_1_2).*-( @d_xi(W_3_3)./dx .- @d_yi(W_3_2)./dx .+ gw.*( @inn(W_1_2) .*@inn(W_2_3) .- @inn(W_1_3).*@inn(W_2_2) ))).-
        # .-(@inn(W_3_3).*fs[1,3,3].-@inn(W_1_3).*fs[3,3,3])
        (@inn(W_3_4).*( @d_yi(W_1_4)./dx .-@d_zi(W_1_3)./dx .+gw.*( @inn(W_2_3) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_3) )).-
        @inn(W_1_4).*( @d_xi(W_3_4)./dx .-@d_zi(W_3_3)./dx .+gw.*( @inn(W_1_3) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_3) )))
        ).+
        gw.*(-@inn(ϕ_1).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_yi(Γ_2)./dx .-gw.*(@inn(W_3_3).*@inn(Γ_1).-@inn(W_1_3).*@inn(Γ_3)).-
        gw.*(@inn(W_3_1).*( @inn(dW_1_3_dt) ).-
        @inn(W_1_1).*( @inn(dW_3_3_dt) )))

    # r(W_2_4)=
    @inn(W_2_4_n) =@inn(W_2_4).+dt.*(@d2_xi(W_2_4)./(dx*dx) .+@d2_yi(W_2_4)./(dx*dx) .+@d2_zi(W_2_4)./(dx*dx) .+gw.*( 
        -(@d_xi(W_3_4)./dx.*@inn(W_1_2).-@d_xi(W_1_4)./dx.*@inn(W_3_2)).-
        (@d_yi(W_3_4)./dx.*@inn(W_1_3).-@d_yi(W_1_4)./dx.*@inn(W_3_3)).-
        (@d_zi(W_3_4)./dx.*@inn(W_1_4).-@d_zi(W_1_4)./dx.*@inn(W_3_4)).-
        (@inn(W_3_2).*-( @d_xi(W_1_4)./dx .-@d_zi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_2) )).-
        @inn(W_1_2).*-( @d_xi(W_3_4)./dx .-@d_zi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_2) ))).-
        (@inn(W_3_3).*-( @d_yi(W_1_4)./dx .-@d_zi(W_1_3)./dx .+gw.*( @inn(W_2_3) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_3) )).-
        @inn(W_1_3).*-( @d_xi(W_3_4)./dx .-@d_zi(W_3_3)./dx .+gw.*( @inn(W_1_3) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_3) )))
        # .-(@inn(W_3_4).*fs[1,4,4].-@inn(W_1_4).*fs[3,4,4])
        ).+
        gw.*(-@inn(ϕ_1).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_zi(Γ_2)./dx .-gw.*(@inn(W_3_4).*@inn(Γ_1).-@inn(W_1_4).*@inn(Γ_3)).-
        gw.*(@inn(W_3_1).*( @inn(dW_1_4_dt) ).-
        @inn(W_1_1).*( @inn(dW_3_4_dt) )))

    # r(W_3_1)=0.

    # r(W_3_2)=
    @inn(W_3_2_n) =@inn(W_3_2).+dt.*(@d2_xi(W_3_2)./(dx*dx) .+@d2_yi(W_3_2)./(dx*dx) .+@d2_zi(W_3_2)./(dx*dx) .+gw.*( 
        -(@d_xi(W_1_2).*@inn(W_2_2)./dx.-@d_xi(W_2_2)./dx.*@inn(W_1_2)).-
        (@d_yi(W_1_2).*@inn(W_2_3)./dx.-@d_yi(W_2_2)./dx.*@inn(W_1_3)).-
        (@d_zi(W_1_2).*@inn(W_2_4)./dx.-@d_zi(W_2_2)./dx.*@inn(W_1_4)).-
        # .-(@inn(W_1_2).*fs[2,2,2].-@inn(W_2_2).*fs[1,2,2])
        (@inn(W_1_3).*( @d_xi(W_2_3)./dx .-@d_yi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_3) .- @inn(W_3_3).*@inn(W_1_2) )).-
        @inn(W_2_3).*( @d_xi(W_1_3)./dx .-@d_yi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_3) .- @inn(W_2_3).*@inn(W_3_2) ))).-
        (@inn(W_1_4).*( @d_xi(W_2_4)./dx .-@d_zi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_2) )).-
        @inn(W_2_4).*( @d_xi(W_1_4)./dx .-@d_zi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_2) )))
        ).+
        gw.*(@inn(ϕ_1).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_3).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_xi(Γ_3)./dx .-gw.*(@inn(W_1_2).*@inn(Γ_2).-@inn(W_2_2).*@inn(Γ_1)).-
        gw.*(@inn(W_1_1).*( @inn(dW_2_2_dt) ).-
        @inn(W_2_1).*( @inn(dW_1_2_dt) )))

    # r(W_3_3)=
    @inn(W_3_3_n) =@inn(W_3_3).+dt.*(@d2_xi(W_3_3)./(dx*dx) .+@d2_yi(W_3_3)./(dx*dx) .+@d2_zi(W_3_3)./(dx*dx) .+gw.*( 
        -(@d_xi(W_1_3)./dx.*@inn(W_2_2)./dx.-@d_xi(W_2_3)./dx.*@inn(W_1_2)).-
        (@d_yi(W_1_3)./dx.*@inn(W_2_3)./dx.-@d_yi(W_2_3)./dx.*@inn(W_1_3)).-
        (@d_zi(W_1_3)./dx.*@inn(W_2_4)./dx.-@d_zi(W_2_3)./dx.*@inn(W_1_4)).-
        (@inn(W_1_2).*-( @d_xi(W_2_3)./dx .-@d_yi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_3) .- @inn(W_3_3).*@inn(W_1_2) )).-
        @inn(W_2_2).*-( @d_xi(W_1_3)./dx .-@d_yi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_3) .- @inn(W_2_3).*@inn(W_3_2) ))).-
        # .-(@inn(W_1_3).*fs[2,3,3].-@inn(W_2_3).*fs[1,3,3])
        (@inn(W_1_4).*( @d_yi(W_2_4)./dx .-@d_zi(W_2_3)./dx .+gw.*( @inn(W_3_3) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_3) )).-
        @inn(W_2_4).*( @d_yi(W_1_4)./dx .-@d_zi(W_1_3)./dx .+gw.*( @inn(W_2_3) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_3) )))
        ).+
        gw.*(@inn(ϕ_1).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_yi(Γ_3)./dx .-gw.*(@inn(W_1_3).*@inn(Γ_2).-@inn(W_2_3).*@inn(Γ_1)).-
        gw.*(@inn(W_1_1).*( @inn(dW_2_3_dt) ).-
        @inn(W_2_1).*( @inn(dW_1_3_dt) )))

    # r(W_3_4)=
    @inn(W_3_4_n) =@inn(W_3_4).+dt.*(@d2_xi(W_3_4)./(dx*dx) .+@d2_yi(W_3_4)./(dx*dx) .+@d2_zi(W_3_4)./(dx*dx) .+gw.*( 
        -(@d_xi(W_1_4)./dx.*@inn(W_2_2).-@d_xi(W_2_4)./dx.*@inn(W_1_2)).-
        (@d_yi(W_1_4)./dx.*@inn(W_2_3).-@d_yi(W_2_4)./dx.*@inn(W_1_3)).-
        (@d_zi(W_1_4)./dx.*@inn(W_2_4).-@d_zi(W_2_4)./dx.*@inn(W_1_4)).-
        (@inn(W_1_2).*-( @d_xi(W_2_4)./dx .-@d_zi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_2) )).-
        @inn(W_2_2).*-( @d_xi(W_1_4)./dx .-@d_zi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_2) ))).-
        (@inn(W_1_3).*-( @d_yi(W_2_4)./dx .-@d_zi(W_2_3)./dx .+gw.*( @inn(W_3_3) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_3) )).-
        @inn(W_2_3).*-( @d_yi(W_1_4)./dx .-@d_zi(W_1_3)./dx .+gw.*( @inn(W_2_3) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_3) )))
        # .-(@inn(W_1_4).*fs[2,4,4].-@inn(W_2_4).*fs[1,4,4])
        ).+
        gw.*(@inn(ϕ_1).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_3).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_zi(Γ_3)./dx .-gw.*(@inn(W_1_4).*@inn(Γ_2).-@inn(W_2_4).*@inn(Γ_1)).-
        gw.*(@inn(W_1_1).*( @inn(dW_2_4_dt) ).-
        @inn(W_2_1).*( @inn(dW_1_4_dt) )))

    # c Y.-fluxes:

    # r(Y_1)=0.

    #r(Y_2)=
    @inn(Y_2_n) =@inn(Y_2).+dt.*(@d2_xi(Y_2)./(dx*dx) .+@d2_yi(Y_3)./(dx*dx) .+@d2_zi(Y_4)./(dx*dx) .+
        gy.*(@inn(ϕ_1).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_xi(Σ))

    # r[19]=
    @inn(Y_3_n) =@inn(Y_3).+dt.*(@d2_xi(Y_2)./(dx*dx) .+@d2_yi(Y_3)./(dx*dx) .+@d2_zi(Y_4)./(dx*dx) .+
        gy.*(@inn(ϕ_1).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_yi(Σ))

    # r[20]=
    @inn(Y_4_n) =@inn(Y_4).+dt.*(@d2_xi(Y_2)./(dx*dx) .+@d2_yi(Y_3)./(dx*dx) .+@d2_zi(Y_4)./(dx*dx) .+
        gy.*(@inn(ϕ_1).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_zi(Σ))

    ##Need to drop these and just not bother evolving these. So no need
    ##to declare in the first place
    @inn(Γ_1_n) = @inn(Γ_1).+dt.*@inn(Γ_1)
    @inn(Γ_2_n) = @inn(Γ_2).+dt.*@inn(Γ_2)
    @inn(Γ_3_n) = @inn(Γ_3).+dt.*@inn(Γ_3)
    @inn(Σ_n) = @inn(Σ).+dt.*@inn(Σ)
    return
end

@parallel function evolve_dot!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n,
    gw,gy,gp2,lambda,vev,dx,dt)
    
    # s[1]=
    @inn(dϕ_1_dt_n) =@inn(dϕ_1_dt).+dt.*@inn(dϕ_1_dt)
    # s[2]=
    @inn(dϕ_2_dt_n) =@inn(dϕ_2_dt).+dt.*@inn(dϕ_2_dt)
    # s[3]=
    @inn(dϕ_3_dt_n) =@inn(dϕ_3_dt).+dt.*@inn(dϕ_3_dt)
    # s[4]=
    @inn(dϕ_4_dt_n) =@inn(dϕ_4_dt).+dt.*@inn(dϕ_4_dt)
    # c
    # c Eq. (2.11) of Baumgarte&Shapiro is $\partial_t A_i = -E_i -...$ so 
    # c we are taking fd(...)=+\partial_t A_i = -E_i (note the sign).
    # s[5]=0.
    # s[6]=
    @inn(dW_1_2_dt_n) =@inn(dW_1_2_dt).+dt.*(@inn(dW_1_2_dt).+
    # c in the gauge $W^a_0=0=Y_0$, f(5...)=0=f(9...)=f(13...) and the line
    # c below vanishes.
        @d_xi(W_1_1)./dx .-gw.*(@inn(W_2_1).*@inn(W_3_2).-@inn(W_3_1).*@inn(W_2_2)))
    # s[7]=
    @inn(dW_1_3_dt_n) =@inn(dW_1_3_dt).+dt.*(@inn(dW_1_3_dt).+
        @d_yi(W_1_1)./dx.-gw.*(@inn(W_2_1).*@inn(W_3_3).-@inn(W_3_1).*@inn(W_2_3)))
    # s[8]=
    @inn(dW_1_4_dt_n) =@inn(dW_1_4_dt).+dt.*(@inn(dW_1_4_dt).+
        @d_zi(W_1_1)./dx.-gw.*(@inn(W_2_1).*@inn(W_3_4).-@inn(W_3_1).*@inn(W_2_4)))

    # s[9]=0.
    # s[10]=
    @inn(dW_2_2_dt_n) =@inn(dW_2_2_dt).+dt.*(@inn(dW_2_2_dt).+
        @d_xi(W_2_1)./dx.-gw.*(@inn(W_3_1).*@inn(W_1_2).-@inn(W_1_1).*@inn(W_3_2)))
    # s[11]=
    @inn(dW_2_3_dt_n) =@inn(dW_2_3_dt).+dt.*(@inn(dW_2_3_dt).+
        @d_yi(W_2_1)./dx.-gw.*(@inn(W_3_1).*@inn(W_1_3).-@inn(W_1_1).*@inn(W_3_3)))
    # s[12]=
    @inn(dW_2_4_dt_n) =@inn(dW_2_4_dt).+dt.*(@inn(dW_2_4_dt).+
        @d_zi(W_2_1)./dx.-gw.*(@inn(W_3_1).*@inn(W_1_4).-@inn(W_1_1).*@inn(W_3_4)))

    # s[13]=0.
    # s[14]=
    @inn(dW_3_2_dt_n) =@inn(dW_3_2_dt).+dt.*(@inn(dW_3_2_dt).+
        @d_xi(W_3_1)./dx.-gw.*(@inn(W_1_1).*@inn(W_2_2).-@inn(W_2_1).*@inn(W_1_2)))
    # s[15]=
    @inn(dW_3_3_dt_n) =@inn(dW_3_3_dt).+dt.*(@inn(dW_3_3_dt).+
        @d_yi(W_3_1)./dx.-gw.*(@inn(W_1_1).*@inn(W_2_3).-@inn(W_2_1).*@inn(W_1_3)))
    # s[16]=
    @inn(dW_3_4_dt_n) =@inn(dW_3_4_dt).+dt.*(@inn(dW_3_4_dt).+
        @d_zi(W_3_1)./dx.-gw.*(@inn(W_1_1).*@inn(W_2_4).-@inn(W_2_1).*@inn(W_1_4)))

    # s[17]=0.
    # s[18]=
    @inn(dY_2_dt_n) =@inn(dY_2_dt).+dt.*(@inn(dY_2_dt).+@d_xi(Y_1)./dx)
    # s[19]=
    @inn(dY_3_dt_n) =@inn(dY_3_dt).+dt.*(@inn(dY_3_dt).+@d_yi(Y_1)./dx)
    # s[20]=
    @inn(dY_4_dt_n) =@inn(dY_4_dt).+dt.*(@inn(dY_4_dt).+@d_zi(Y_1)./dx)

    # c fluxes for gauge functions:
    # cc if on boundaries:
    # c      if(abs(i).eq.latx.or.abs(j).eq.laty.or.abs(k).eq.latz) then
    # cc radial unit vector:
    # c        px=dfloat(i)/sqrt(dfloat(i**2+j**2+k**2))
    # c        py=dfloat(j)/sqrt(dfloat(i**2+j**2+k**2))
    # c        pz=dfloat(k)/sqrt(dfloat(i**2+j**2+k**2))
    # cc
    # c       s(21)=-(px*dfdx(21)+py*dfdy(21)+pz*dfdz(21))
    # c       s(22)=-(px*dfdx(22)+py*dfdy(22)+pz*dfdz(22))
    # c       s(23)=-(px*dfdx(23)+py*dfdy(23)+pz*dfdz(23))
    # c       s(24)=-(px*dfdx(24)+py*dfdy(24)+pz*dfdz(24))
    # c
    # cc if not on boundaries:
    # c      else
    # c
    # s(Γ_1)=
    @inn(dΓ_1_dt_n) =@inn(dΓ_1_dt).+dt.*((1.0.-gp2).*(@d2_xi(W_1_2)./(dx*dx) .+@d2_yi(W_1_3)./(dx*dx) .+@d2_zi(W_1_4)./(dx*dx)).+
        gp2.*gw.*(
        -(@inn(W_2_2).*@inn(dW_3_2_dt).-
        @inn(W_3_2).*@inn(dW_2_2_dt)).-
        (@inn(W_2_3).*@inn(dW_3_3_dt).-
        @inn(W_3_3).*@inn(dW_2_3_dt)).-
        (@inn(W_2_4).*@inn(dW_3_4_dt).-
        @inn(W_3_4).*@inn(dW_2_4_dt))).+
    # c charge from Higgs: 
        gp2.*gw.*(@inn(ϕ_1).*(@inn(dϕ_4_dt) .-@D_1ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@inn(dϕ_1_dt) .-@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@inn(dϕ_2_dt) .-@D_1ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@inn(dϕ_3_dt) .-@D_1ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))))

    # s(Γ_2)=
    @inn(dΓ_2_dt_n) =@inn(dΓ_2_dt).+dt.*((1.0.-gp2).*(@d2_xi(W_2_2)./(dx*dx) .+@d2_yi(W_2_3)./(dx*dx) .+@d2_zi(W_2_4)./(dx*dx)).+
        gp2 .*gw.*(
        -(@inn(W_3_2).*@inn(dW_1_2_dt).-
        @inn(W_1_2).*@inn(dW_3_2_dt)).-
        (@inn(W_3_3).*@inn(dW_1_3_dt).-
        @inn(W_1_3).*@inn(dW_3_3_dt)).-
        (@inn(W_3_4).*@inn(dW_1_4_dt).-
        @inn(W_1_4).*@inn(dW_3_4_dt))).+
    # c charge from Higgs: 
        gp2 .*gw.*(@inn(ϕ_3).*(@inn(dϕ_1_dt) .-@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_1).*(@inn(dϕ_3_dt) .-@D_1ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@inn(dϕ_2_dt) .-@D_1ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@inn(dϕ_4_dt) .-@D_1ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))))

    # s(Γ_3)=
    @inn(dΓ_3_dt_n) =@inn(dΓ_3_dt).+dt.*((1.0.-gp2).*(@d2_xi(W_3_2)./(dx*dx) .+@d2_yi(W_3_3)./(dx*dx) .+@d2_zi(W_3_4)./(dx*dx)).+
        gp2 .*gw.*(
        -(@inn(W_1_2).*@inn(dW_2_2_dt).-
        @inn(W_2_2).*@inn(dW_1_2_dt)).-
        (@inn(W_1_3).*@inn(dW_2_3_dt).-
        @inn(W_2_3).*@inn(dW_1_3_dt)).-
        (@inn(W_1_4).*@inn(dW_2_4_dt).-
        @inn(W_2_4).*@inn(dW_1_4_dt))).+
    # c current from Higgs: 
        gp2 .*gw.*(@inn(ϕ_1).*(@inn(dϕ_2_dt) .-@D_1ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@inn(dϕ_1_dt) .-@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@inn(dϕ_3_dt) .-@D_1ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_3).*(@inn(dϕ_4_dt) .-@D_1ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))))

    # s(Σ)=
    @inn(dΣ_dt_n) =@inn(dΣ_dt).+dt.*((1.0.-gp2).*(@d2_xi(Y_2)./(dx*dx) .+@d2_yi(Y_3)./(dx*dx) .+@d2_zi(Y_4)./(dx*dx)).+
    # c current from Higgs: 
        gp2 .*gy.*(@inn(ϕ_1)*(@inn(dϕ_2_dt) .-@D_1ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@inn(dϕ_1_dt) .-@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@inn(dϕ_4_dt) .-@D_1ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@inn(dϕ_3_dt) .-@D_1ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))))

    return
end

@parallel function avg_half_step!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    Γ_1_n,Γ_2_n,Γ_3_n,Σ_n)

    @inn(ϕ_1_n)=(@inn(ϕ_1_n)+@inn(ϕ_1)).*0.5
    @inn(ϕ_2_n)=(@inn(ϕ_2_n)+@inn(ϕ_2)).*0.5
    @inn(ϕ_3_n)=(@inn(ϕ_3_n)+@inn(ϕ_3)).*0.5
    @inn(ϕ_4_n)=(@inn(ϕ_4_n)+@inn(ϕ_4)).*0.5
    @inn(W_1_2_n)=(@inn(W_1_2)+@inn(W_1_2_n)).*0.5
    @inn(W_1_3_n)=(@inn(W_1_3)+@inn(W_1_3_n)).*0.5
    @inn(W_1_4_n)=(@inn(W_1_4)+@inn(W_1_4_n)).*0.5
    @inn(W_2_2_n)=(@inn(W_2_2)+@inn(W_2_2_n)).*0.5
    @inn(W_2_3_n)=(@inn(W_2_3)+@inn(W_2_3_n)).*0.5
    @inn(W_2_4_n)=(@inn(W_2_4)+@inn(W_2_4_n)).*0.5
    @inn(W_3_2_n)=(@inn(W_3_2)+@inn(W_3_2_n)).*0.5
    @inn(W_3_3_n)=(@inn(W_3_3)+@inn(W_3_3_n)).*0.5
    @inn(W_3_4_n)=(@inn(W_3_4)+@inn(W_3_4_n)).*0.5
    @inn(Y_2_n)=(@inn(Y_2)+@inn(Y_2_n)).*0.5
    @inn(Y_3_n)=(@inn(Y_3)+@inn(Y_3_n)).*0.5
    @inn(Y_4_n)=(@inn(Y_4)+@inn(Y_4_n)).*0.5
    @inn(Γ_1_n)=(@inn(Γ_1_n)+@inn(Γ_1)).*0.5
    @inn(Γ_2_n)=(@inn(Γ_2_n)+@inn(Γ_2)).*0.5
    @inn(Γ_3_n)=(@inn(Γ_3_n)+@inn(Γ_3)).*0.5
    @inn(Σ_n)=(@inn(Σ_n)+@inn(Σ)).*0.5

    return
end

@parallel function avg_half_step_dot!(dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n)

    @inn(dϕ_1_dt_n)=(@inn(dϕ_1_dt_n)+@inn(dϕ_1_dt)).*0.5
    @inn(dϕ_2_dt_n)=(@inn(dϕ_2_dt_n)+@inn(dϕ_2_dt)).*0.5
    @inn(dϕ_3_dt_n)=(@inn(dϕ_3_dt_n)+@inn(dϕ_3_dt)).*0.5
    @inn(dϕ_4_dt_n)=(@inn(dϕ_4_dt_n)+@inn(dϕ_4_dt)).*0.5
    @inn(dW_1_2_dt_n)=(@inn(dW_1_2_dt)+@inn(dW_1_2_dt_n)).*0.5
    @inn(dW_1_3_dt_n)=(@inn(dW_1_3_dt)+@inn(dW_1_3_dt_n)).*0.5
    @inn(dW_1_4_dt_n)=(@inn(dW_1_4_dt)+@inn(dW_1_4_dt_n)).*0.5
    @inn(dW_2_2_dt_n)=(@inn(dW_2_2_dt)+@inn(dW_2_2_dt_n)).*0.5
    @inn(dW_2_3_dt_n)=(@inn(dW_2_3_dt)+@inn(dW_2_3_dt_n)).*0.5
    @inn(dW_2_4_dt_n)=(@inn(dW_2_4_dt)+@inn(dW_2_4_dt_n)).*0.5
    @inn(dW_3_2_dt_n)=(@inn(dW_3_2_dt)+@inn(dW_3_2_dt_n)).*0.5
    @inn(dW_3_3_dt_n)=(@inn(dW_3_3_dt)+@inn(dW_3_3_dt_n)).*0.5
    @inn(dW_3_4_dt_n)=(@inn(dW_3_4_dt)+@inn(dW_3_4_dt_n)).*0.5
    @inn(dY_2_dt_n)=(@inn(dY_2_dt)+@inn(dY_2_dt_n)).*0.5
    @inn(dY_3_dt_n)=(@inn(dY_3_dt)+@inn(dY_3_dt_n)).*0.5
    @inn(dY_4_dt_n)=(@inn(dY_4_dt)+@inn(dY_4_dt_n)).*0.5
    @inn(dΓ_1_dt_n)=(@inn(dΓ_1_dt_n)+@inn(dΓ_1_dt)).*0.5
    @inn(dΓ_2_dt_n)=(@inn(dΓ_2_dt_n)+@inn(dΓ_2_dt)).*0.5
    @inn(dΓ_3_dt_n)=(@inn(dΓ_3_dt_n)+@inn(dΓ_3_dt)).*0.5
    @inn(dΣ_dt_n)=(@inn(dΣ_dt_n)+@inn(dΣ_dt)).*0.5

    return
end

@parallel function leaforward!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    Γ_1_n,Γ_2_n,Γ_3_n,Σ_n,
    gw,gy,gp2,lambda,vev,dx,dt)
    
    # @inn(test_arr) = @inn(dϕ_1_dt).+gw*@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    # W_1_1,W_1_2,W_1_3,W_1_4,
    # W_2_1,W_2_2,W_2_3,W_2_4,
    # W_3_1,W_3_2,W_3_3,W_3_4,
    # Y_1,Y_2,Y_3,Y_4)
    
    ##swapping namespaces when compared to evolve
    ##data input: _n is input from previous step
    ##without is the information from average half step

    #The expressions below calculate fluxes from the fields at half step
    #and assign to global _n arrays which is is non-_n arrays in this function

    @inn(ϕ_1_n) = @inn(ϕ_1_n) .+ dt.*( @d2_xi(ϕ_1)./(dx*dx) .+@d2_yi(ϕ_1)./(dx*dx) .+@d2_zi(ϕ_1)./(dx*dx) .-
    0.5*gw.*((-@inn(W_1_2).*@d_xi(ϕ_4)./dx.-@inn(W_1_3).*@d_yi(ϕ_4)./dx.-@inn(W_1_4).*@d_zi(ϕ_4)./dx).-
    (-@inn(W_2_2).*@d_xi(ϕ_3)./dx.-@inn(W_2_3).*@d_yi(ϕ_3)./dx.-@inn(W_2_4).*@d_zi(ϕ_3)./dx).+
    (-@inn(W_3_2).*@d_xi(ϕ_2)./dx.-@inn(W_3_3).*@d_yi(ϕ_2)./dx.-@inn(W_3_4).*@d_zi(ϕ_2)./dx)).-
    0.5*gy.*(-@inn(Y_2).*@d_xi(ϕ_2)./dx.-@inn(Y_3).*@d_yi(ϕ_2)./dx.-@inn(Y_4).*@d_zi(ϕ_2)./dx).-
    0.5*gw.*((-@inn(W_1_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_4).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    (-@inn(W_2_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_3).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).+
    (-@inn(W_3_2).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)))).-
    0.5*gy.*(-@inn(Y_2).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    2.0*lambda.*((@inn(ϕ_1).*@inn(ϕ_1)) .+(@inn(ϕ_2).*@inn(ϕ_2)) .+(@inn(ϕ_3).*@inn(ϕ_3)) .+(@inn(ϕ_4).*@inn(ϕ_4)) .-vev*vev).*@inn(ϕ_1).+
    0.5 .*((gw.*@inn(Γ_3) .+gy.*@inn(Σ)).*@inn(ϕ_2).-gw.*@inn(Γ_2) .*@inn(ϕ_3).+gw.*@inn(Γ_1).*@inn(ϕ_4)))

    @inn(ϕ_2_n) =@inn(ϕ_2_n) .+ dt.*(@d2_xi(ϕ_2)./(dx*dx) .+@d2_yi(ϕ_2)./(dx*dx) .+@d2_zi(ϕ_2)./(dx*dx) .+
    0.5*gw.*((-@inn(W_1_2).*@d_xi(ϕ_3)./dx.-@inn(W_1_3).*@d_yi(ϕ_3)./dx.-@inn(W_1_4).*@d_zi(ϕ_3)./dx).+
    (-@inn(W_2_2).*@d_xi(ϕ_4)./dx.-@inn(W_2_3).*@d_yi(ϕ_4)./dx.-@inn(W_2_4).*@d_zi(ϕ_4)./dx).+
    (-@inn(W_3_2).*@d_xi(ϕ_1)./dx.-@inn(W_3_3).*@d_yi(ϕ_1)./dx.-@inn(W_3_4).*@d_zi(ϕ_1)./dx)).+
    0.5.*gy.*(-@inn(Y_2).*@d_xi(ϕ_1)./dx.-@inn(Y_3).*@d_yi(ϕ_1)./dx.-@inn(Y_4).*@d_zi(ϕ_1)./dx).+
    0.5.*gw.*((-@inn(W_1_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_3).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).+
    (-@inn(W_2_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_4).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).+
    (-@inn(W_3_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)))).+
    0.5.*gy.*(-@inn(Y_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    2.0.*lambda.*((@inn(ϕ_1).*@inn(ϕ_1)) .+(@inn(ϕ_2).*@inn(ϕ_2)) .+(@inn(ϕ_3).*@inn(ϕ_3)) .+(@inn(ϕ_4).*@inn(ϕ_4)) .-vev*vev)*@inn(ϕ_2).-
    0.5 .*((gw*@inn(Γ_3) .+gy.*@inn(Σ)) .*@inn(ϕ_1) .+gw .*@inn(Γ_1).*@inn(ϕ_3) .+gw.*@inn(Γ_2) .*@inn(ϕ_4)))

    @inn(ϕ_3_n) =@inn(ϕ_3_n) .+ dt.*(@d2_xi(ϕ_3)./(dx*dx) .+@d2_yi(ϕ_3)./(dx*dx) .+@d2_zi(ϕ_3)./(dx*dx) .-
    0.5*gw.*((-@inn(W_1_2).*@d_xi(ϕ_2)./dx.-@inn(W_1_3).*@d_yi(ϕ_2)./dx.-@inn(W_1_4).*@d_zi(ϕ_2)./dx).+
    (-@inn(W_2_2).*@d_xi(ϕ_1)./dx.-@inn(W_2_3).*@d_yi(ϕ_1)./dx.-@inn(W_2_4).*@d_zi(ϕ_1)./dx).-
    (-@inn(W_3_2).*@d_xi(ϕ_4)./dx.-@inn(W_3_3).*@d_yi(ϕ_4)./dx.-@inn(W_3_4).*@d_zi(ϕ_4)./dx)).-
    0.5.*gy.*(-@inn(Y_2).*@d_xi(ϕ_4)./dx.-@inn(Y_3).*@d_yi(ϕ_4)./dx.-@inn(Y_4).*@d_zi(ϕ_4)./dx).-
    0.5.*gw.*((-@inn(W_1_2).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).+
    (-@inn(W_2_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    (-@inn(W_3_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_4).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)))).-
    0.5.*gy.*(-@inn(Y_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_4).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    2.0.*lambda.*((@inn(ϕ_1).*@inn(ϕ_1)) .+(@inn(ϕ_2).*@inn(ϕ_2)) .+(@inn(ϕ_3).*@inn(ϕ_3)) .+(@inn(ϕ_4).*@inn(ϕ_4)) .-vev*vev).*@inn(ϕ_3).+
    0.5 .*((-gw.*@inn(Γ_3) .+gy*@inn(Σ))*@inn(ϕ_4).+gw .*@inn(Γ_2) .*@inn(ϕ_1).+gw .*@inn(Γ_1) .*@inn(ϕ_2)))

    @inn(ϕ_4_n) =@inn(ϕ_4_n) .+ dt.*(@d2_xi(ϕ_4)./(dx*dx) .+@d2_yi(ϕ_4)./(dx*dx) .+@d2_zi(ϕ_4)./(dx*dx) .+
    0.5.*gw.*((-@inn(W_1_2).*@d_xi(ϕ_1)./dx.-@inn(W_1_3).*@d_yi(ϕ_1)./dx.-@inn(W_1_4).*@d_zi(ϕ_1)./dx).-
    (-@inn(W_2_2).*@d_xi(ϕ_2)./dx.-@inn(W_2_3).*@d_yi(ϕ_2)./dx.-@inn(W_2_4).*@d_zi(ϕ_2)./dx).-
    (-@inn(W_3_2).*@d_xi(ϕ_3)./dx.-@inn(W_3_3).*@d_yi(ϕ_3)./dx.-@inn(W_3_4).*@d_zi(ϕ_3)./dx)).+
    0.5.*gy.*(-@inn(Y_2).*@d_xi(ϕ_3)./dx.-@inn(Y_3).*@d_yi(ϕ_3)./dx.-@inn(Y_4).*@d_zi(ϕ_3)./dx).+
    0.5.*gw.*((-@inn(W_1_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_1_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    (-@inn(W_2_2).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_2_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    (-@inn(W_3_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_3).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(W_3_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)))).+
    0.5.*gy.*(-@inn(Y_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_3).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
    @inn(Y_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    2.0.*lambda.*((@inn(ϕ_1).*@inn(ϕ_1)) .+(@inn(ϕ_2).*@inn(ϕ_2)) .+(@inn(ϕ_3).*@inn(ϕ_3)) .+(@inn(ϕ_4).*@inn(ϕ_4)) .-vev.*vev).*@inn(ϕ_4).-
    0.5 .*((-gw .*@inn(Γ_3) .+gy.*@inn(Σ)).*@inn(ϕ_3).+gw.*@inn(Γ_1) .*@inn(ϕ_1).-gw.*@inn(Γ_2) .*@inn(ϕ_2)))

    # c W.-fluxes:
    # c
    # r(W_1_1)=0.

    # r(W_1_2)= 
    @inn(W_1_2_n) =@inn(W_1_2_n).+dt.*(@d2_xi(W_1_2)./(dx*dx) .+@d2_yi(W_1_2)./(dx*dx) .+@d2_zi(W_1_2)./(dx*dx) .+gw.*( 
        -(@d_xi(W_2_2)./dx.*@inn(W_3_2).-@d_xi(W_3_2)./dx.*@inn(W_2_2)).-
        (@d_yi(W_2_2)./dx.*@inn(W_3_3).-@d_yi(W_3_2)./dx.*@inn(W_2_3)).-
        (@d_zi(W_2_2)./dx.*@inn(W_3_4).-@d_zi(W_3_2)./dx.*@inn(W_2_4)).-
        # .-(@inn(W_2_2).*fs[3,2,2].-@inn(W_3_2).*fs[2,2,2])
        (@inn(W_2_3).*( @d_xi(W_3_3)./dx .- @d_yi(W_3_2)./dx .+ gw.*( @inn(W_1_2) .*@inn(W_2_3) .- @inn(W_1_3).*@inn(W_2_2) )).-
        @inn(W_3_3).*( @d_xi(W_2_3)./dx .-@d_yi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_3) .- @inn(W_3_3).*@inn(W_1_2) ))).-
        (@inn(W_2_4).*( @d_xi(W_3_4)./dx .-@d_zi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_2) )).-
        @inn(W_3_4).*( @d_xi(W_2_4)./dx .-@d_zi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_2) )))
        ).+
    # c current from Higgs:
        gw.*(@inn(ϕ_1).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
    # c gauge fixing terms:
        @d_xi(Γ_1)./dx .-gw.*(@inn(W_2_2).*@inn(Γ_3).-@inn(W_3_2).*@inn(Γ_2)).-
# c new terms in Num. Rel. method (though we have chosen
# c @inn(W_1_1)=0=@inn(W_2_1)=@inn(W_3_1) so these terms don't play a role here).:
        gw.*(@inn(W_2_1).*( @inn(dW_3_2_dt) ).-
        @inn(W_3_1).*( @inn(dW_2_2_dt) )))

    # r(W_1_3)=
    @inn(W_1_3_n) =@inn(W_1_3_n).+dt.*(@d2_xi(W_1_3)./(dx*dx) .+@d2_yi(W_1_3)./(dx*dx) .+@d2_zi(W_1_3)./(dx*dx) .+gw.*( 
        -(@d_xi(W_2_3)./dx.*@inn(W_3_2).-@d_xi(W_3_3)./dx.*@inn(W_2_2)).-
        (@d_yi(W_2_3)./dx.*@inn(W_3_3).-@d_yi(W_3_3)./dx.*@inn(W_2_3)).-
        (@d_zi(W_2_3)./dx.*@inn(W_3_4).-@d_zi(W_3_3)./dx.*@inn(W_2_4)).-
        (@inn(W_2_2).*-( @d_xi(W_3_3)./dx .- @d_yi(W_3_2)./dx .+ gw.*( @inn(W_1_2) .*@inn(W_2_3) .- @inn(W_1_3).*@inn(W_2_2) )).-
        @inn(W_3_2).*-( @d_xi(W_2_3)./dx .-@d_yi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_3) .- @inn(W_3_3).*@inn(W_1_2) ))).-
        # .-(@inn(W_2_3).*fs[3,3,3].-@inn(W_3_3).*fs[2,3,3])
        (@inn(W_2_4).*( @d_xi(W_3_4)./dx .-@d_zi(W_3_3)./dx .+gw.*( @inn(W_1_3) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_3) )).-
        @inn(W_3_4).*( @d_yi(W_2_4)./dx .-@d_zi(W_2_3)./dx .+gw.*( @inn(W_3_3) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_3) )))
        ).+
        gw.*(@inn(ϕ_1).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_yi(Γ_1)./dx .-gw.*(@inn(W_2_3).*@inn(Γ_3).-@inn(W_3_3).*@inn(Γ_2)).-
        gw.*(@inn(W_2_1).*( @inn(dW_3_3_dt) ).-
        @inn(W_3_1).*( @inn(dW_2_3_dt) )))

    # r(W_1_4)=
    @inn(W_1_4_n) =@inn(W_1_4_n).+dt.*(@d2_xi(W_1_4)./(dx*dx) .+@d2_yi(W_1_4)./(dx*dx) .+@d2_zi(W_1_4)./(dx*dx) .+gw.*( 
        -(@d_xi(W_2_4)./dx.*@inn(W_3_2).-@d_xi(W_3_4)./dx.*@inn(W_2_2)).-
        (@d_yi(W_2_4)./dx.*@inn(W_3_3).-@d_yi(W_3_4)./dx.*@inn(W_2_3)).-
        (@d_zi(W_2_4)./dx.*@inn(W_3_4).-@d_zi(W_3_4)./dx.*@inn(W_2_4)).-
        (@inn(W_2_2).*-( @d_xi(W_3_4)./dx .-@d_zi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_2) )).-
        @inn(W_3_2).*-( @d_xi(W_2_4)./dx .-@d_zi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_2) ))).-
        (@inn(W_2_3).*-( @d_xi(W_3_4)./dx .-@d_zi(W_3_3)./dx .+gw.*( @inn(W_1_3) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_3) )).-
        @inn(W_3_3).*-( @d_yi(W_2_4)./dx .-@d_zi(W_2_3)./dx .+gw.*( @inn(W_3_3) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_3) )))
        # .-(@inn(W_2_4).*fs[3,4,4].-@inn(W_3_4).*fs[2,4,4])
        ).+
        gw.*(@inn(ϕ_1).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_zi(Γ_1)./dx .-gw.*(@inn(W_2_4).*@inn(Γ_3).-@inn(W_3_4).*@inn(Γ_2)).-
        gw.*(@inn(W_2_1).*( @inn(dW_3_4_dt) ).-
        @inn(W_3_1).*( @inn(dW_2_4_dt) )))

    # r(W_2_1)=0.

    # r(W_2_2)=
    @inn(W_2_2_n) =@inn(W_2_2_n).+dt.*(@d2_xi(W_2_2)./(dx*dx) .+@d2_yi(W_2_2)./(dx*dx) .+@d2_zi(W_2_2)./(dx*dx) .+gw.*( 
        -(@d_xi(W_3_2)./dx.*@inn(W_1_2).-@d_xi(W_1_2)./dx.*@inn(W_3_2)).-
        (@d_yi(W_3_2)./dx.*@inn(W_1_3).-@d_yi(W_1_2)./dx.*@inn(W_3_3)).-
        (@d_zi(W_3_2)./dx.*@inn(W_1_4).-@d_zi(W_1_2)./dx.*@inn(W_3_4)).-
        # .-(@inn(W_3_2).*fs[1,2,2].-@inn(W_1_2).*fs[3,2,2])
        (@inn(W_3_3).*( @d_xi(W_1_3)./dx .-@d_yi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_3) .- @inn(W_2_3).*@inn(W_3_2) )).-
        @inn(W_1_3).*( @d_xi(W_3_3)./dx .-@d_yi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_3) .- @inn(W_1_3).*@inn(W_2_2) ))).-
        (@inn(W_3_4).*( @d_xi(W_1_4)./dx .-@d_zi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_2) )).-
        @inn(W_1_4).*( @d_xi(W_3_4)./dx .-@d_zi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_2) )))
        ).+
        gw.*(-@inn(ϕ_1).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_xi(Γ_2)./dx .-gw.*(@inn(W_3_2).*@inn(Γ_1).-@inn(W_1_2).*@inn(Γ_3)).-
        gw.*(@inn(W_3_1).*( @inn(dW_1_2_dt) ).-
        @inn(W_1_1).*( @inn(dW_3_2_dt) )))

    # r(W_2_3)=
    @inn(W_2_3_n) =@inn(W_2_3_n).+dt.*(@d2_xi(W_2_3)./(dx*dx) .+@d2_yi(W_2_3)./(dx*dx) .+@d2_zi(W_2_3)./(dx*dx) .+gw.*( 
        -(@d_xi(W_3_3)./dx.*@inn(W_1_2).-@d_xi(W_1_3)./dx.*@inn(W_3_2)).-
        (@d_yi(W_3_3)./dx.*@inn(W_1_3).-@d_yi(W_1_3)./dx.*@inn(W_3_3)).-
        (@d_zi(W_3_3)./dx.*@inn(W_1_4).-@d_zi(W_1_3)./dx.*@inn(W_3_4)).-
        (@inn(W_3_2).*-( @d_xi(W_1_3)./dx .-@d_yi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_3) .- @inn(W_2_3).*@inn(W_3_2) )).-
        @inn(W_1_2).*-( @d_xi(W_3_3)./dx .- @d_yi(W_3_2)./dx .+ gw.*( @inn(W_1_2) .*@inn(W_2_3) .- @inn(W_1_3).*@inn(W_2_2) ))).-
        # .-(@inn(W_3_3).*fs[1,3,3].-@inn(W_1_3).*fs[3,3,3])
        (@inn(W_3_4).*( @d_yi(W_1_4)./dx .-@d_zi(W_1_3)./dx .+gw.*( @inn(W_2_3) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_3) )).-
        @inn(W_1_4).*( @d_xi(W_3_4)./dx .-@d_zi(W_3_3)./dx .+gw.*( @inn(W_1_3) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_3) )))
        ).+
        gw.*(-@inn(ϕ_1).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_yi(Γ_2)./dx .-gw.*(@inn(W_3_3).*@inn(Γ_1).-@inn(W_1_3).*@inn(Γ_3)).-
        gw.*(@inn(W_3_1).*( @inn(dW_1_3_dt) ).-
        @inn(W_1_1).*( @inn(dW_3_3_dt) )))

    # r(W_2_4)=
    @inn(W_2_4_n) =@inn(W_2_4_n).+dt.*(@d2_xi(W_2_4)./(dx*dx) .+@d2_yi(W_2_4)./(dx*dx) .+@d2_zi(W_2_4)./(dx*dx) .+gw.*( 
        -(@d_xi(W_3_4)./dx.*@inn(W_1_2).-@d_xi(W_1_4)./dx.*@inn(W_3_2)).-
        (@d_yi(W_3_4)./dx.*@inn(W_1_3).-@d_yi(W_1_4)./dx.*@inn(W_3_3)).-
        (@d_zi(W_3_4)./dx.*@inn(W_1_4).-@d_zi(W_1_4)./dx.*@inn(W_3_4)).-
        (@inn(W_3_2).*-( @d_xi(W_1_4)./dx .-@d_zi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_2) )).-
        @inn(W_1_2).*-( @d_xi(W_3_4)./dx .-@d_zi(W_3_2)./dx .+gw.*( @inn(W_1_2) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_2) ))).-
        (@inn(W_3_3).*-( @d_yi(W_1_4)./dx .-@d_zi(W_1_3)./dx .+gw.*( @inn(W_2_3) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_3) )).-
        @inn(W_1_3).*-( @d_xi(W_3_4)./dx .-@d_zi(W_3_3)./dx .+gw.*( @inn(W_1_3) .*@inn(W_2_4) .- @inn(W_1_4).*@inn(W_2_3) )))
        # .-(@inn(W_3_4).*fs[1,4,4].-@inn(W_1_4).*fs[3,4,4])
        ).+
        gw.*(-@inn(ϕ_1).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_zi(Γ_2)./dx .-gw.*(@inn(W_3_4).*@inn(Γ_1).-@inn(W_1_4).*@inn(Γ_3)).-
        gw.*(@inn(W_3_1).*( @inn(dW_1_4_dt) ).-
        @inn(W_1_1).*( @inn(dW_3_4_dt) )))

    # r(W_3_1)=0.

    # r(W_3_2)=
    @inn(W_3_2_n) =@inn(W_3_2_n).+dt.*(@d2_xi(W_3_2)./(dx*dx) .+@d2_yi(W_3_2)./(dx*dx) .+@d2_zi(W_3_2)./(dx*dx) .+gw.*( 
        -(@d_xi(W_1_2).*@inn(W_2_2)./dx.-@d_xi(W_2_2)./dx.*@inn(W_1_2)).-
        (@d_yi(W_1_2).*@inn(W_2_3)./dx.-@d_yi(W_2_2)./dx.*@inn(W_1_3)).-
        (@d_zi(W_1_2).*@inn(W_2_4)./dx.-@d_zi(W_2_2)./dx.*@inn(W_1_4)).-
        # .-(@inn(W_1_2).*fs[2,2,2].-@inn(W_2_2).*fs[1,2,2])
        (@inn(W_1_3).*( @d_xi(W_2_3)./dx .-@d_yi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_3) .- @inn(W_3_3).*@inn(W_1_2) )).-
        @inn(W_2_3).*( @d_xi(W_1_3)./dx .-@d_yi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_3) .- @inn(W_2_3).*@inn(W_3_2) ))).-
        (@inn(W_1_4).*( @d_xi(W_2_4)./dx .-@d_zi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_2) )).-
        @inn(W_2_4).*( @d_xi(W_1_4)./dx .-@d_zi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_2) )))
        ).+
        gw.*(@inn(ϕ_1).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_3).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_xi(Γ_3)./dx .-gw.*(@inn(W_1_2).*@inn(Γ_2).-@inn(W_2_2).*@inn(Γ_1)).-
        gw.*(@inn(W_1_1).*( @inn(dW_2_2_dt) ).-
        @inn(W_2_1).*( @inn(dW_1_2_dt) )))

    # r(W_3_3)=
    @inn(W_3_3_n) =@inn(W_3_3_n).+dt.*(@d2_xi(W_3_3)./(dx*dx) .+@d2_yi(W_3_3)./(dx*dx) .+@d2_zi(W_3_3)./(dx*dx) .+gw.*( 
        -(@d_xi(W_1_3)./dx.*@inn(W_2_2)./dx.-@d_xi(W_2_3)./dx.*@inn(W_1_2)).-
        (@d_yi(W_1_3)./dx.*@inn(W_2_3)./dx.-@d_yi(W_2_3)./dx.*@inn(W_1_3)).-
        (@d_zi(W_1_3)./dx.*@inn(W_2_4)./dx.-@d_zi(W_2_3)./dx.*@inn(W_1_4)).-
        (@inn(W_1_2).*-( @d_xi(W_2_3)./dx .-@d_yi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_3) .- @inn(W_3_3).*@inn(W_1_2) )).-
        @inn(W_2_2).*-( @d_xi(W_1_3)./dx .-@d_yi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_3) .- @inn(W_2_3).*@inn(W_3_2) ))).-
        # .-(@inn(W_1_3).*fs[2,3,3].-@inn(W_2_3).*fs[1,3,3])
        (@inn(W_1_4).*( @d_yi(W_2_4)./dx .-@d_zi(W_2_3)./dx .+gw.*( @inn(W_3_3) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_3) )).-
        @inn(W_2_4).*( @d_yi(W_1_4)./dx .-@d_zi(W_1_3)./dx .+gw.*( @inn(W_2_3) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_3) )))
        ).+
        gw.*(@inn(ϕ_1).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_yi(Γ_3)./dx .-gw.*(@inn(W_1_3).*@inn(Γ_2).-@inn(W_2_3).*@inn(Γ_1)).-
        gw.*(@inn(W_1_1).*( @inn(dW_2_3_dt) ).-
        @inn(W_2_1).*( @inn(dW_1_3_dt) )))

    # r(W_3_4)=
    @inn(W_3_4_n) =@inn(W_3_4_n).+dt.*(@d2_xi(W_3_4)./(dx*dx) .+@d2_yi(W_3_4)./(dx*dx) .+@d2_zi(W_3_4)./(dx*dx) .+gw.*( 
        -(@d_xi(W_1_4)./dx.*@inn(W_2_2).-@d_xi(W_2_4)./dx.*@inn(W_1_2)).-
        (@d_yi(W_1_4)./dx.*@inn(W_2_3).-@d_yi(W_2_4)./dx.*@inn(W_1_3)).-
        (@d_zi(W_1_4)./dx.*@inn(W_2_4).-@d_zi(W_2_4)./dx.*@inn(W_1_4)).-
        (@inn(W_1_2).*-( @d_xi(W_2_4)./dx .-@d_zi(W_2_2)./dx .+gw.*( @inn(W_3_2) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_2) )).-
        @inn(W_2_2).*-( @d_xi(W_1_4)./dx .-@d_zi(W_1_2)./dx .+gw.*( @inn(W_2_2) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_2) ))).-
        (@inn(W_1_3).*-( @d_yi(W_2_4)./dx .-@d_zi(W_2_3)./dx .+gw.*( @inn(W_3_3) .*@inn(W_1_4) .- @inn(W_3_4).*@inn(W_1_3) )).-
        @inn(W_2_3).*-( @d_yi(W_1_4)./dx .-@d_zi(W_1_3)./dx .+gw.*( @inn(W_2_3) .*@inn(W_3_4) .- @inn(W_2_4).*@inn(W_3_3) )))
        # .-(@inn(W_1_4).*fs[2,4,4].-@inn(W_2_4).*fs[1,4,4])
        ).+
        gw.*(@inn(ϕ_1).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_3).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_zi(Γ_3)./dx .-gw.*(@inn(W_1_4).*@inn(Γ_2).-@inn(W_2_4).*@inn(Γ_1)).-
        gw.*(@inn(W_1_1).*( @inn(dW_2_4_dt) ).-
        @inn(W_2_1).*( @inn(dW_1_4_dt) )))

    # c Y.-fluxes:

    # r(Y_1)=0.

    #r(Y_2)=
    @inn(Y_2_n) =@inn(Y_2_n).+dt.*(@d2_xi(Y_2)./(dx*dx) .+@d2_yi(Y_3)./(dx*dx) .+@d2_zi(Y_4)./(dx*dx) .+
        gy.*(@inn(ϕ_1).*(@d_xi(ϕ_2)./dx .-@D_2ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_xi(ϕ_1)./dx .-@D_2ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_xi(ϕ_4)./dx .-@D_2ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_xi(ϕ_3)./dx .+@D_2ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_xi(Σ))

    # r[19]=
    @inn(Y_3_n) =@inn(Y_3_n).+dt.*(@d2_xi(Y_2)./(dx*dx) .+@d2_yi(Y_3)./(dx*dx) .+@d2_zi(Y_4)./(dx*dx) .+
        gy.*(@inn(ϕ_1).*(@d_yi(ϕ_2)./dx .-@D_3ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_yi(ϕ_1)./dx .-@D_3ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_yi(ϕ_4)./dx .-@D_3ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_yi(ϕ_3)./dx .+@D_3ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_yi(Σ))

    # r[20]=
    @inn(Y_4_n) =@inn(Y_4_n).+dt.*(@d2_xi(Y_2)./(dx*dx) .+@d2_yi(Y_3)./(dx*dx) .+@d2_zi(Y_4)./(dx*dx) .+
        gy.*(@inn(ϕ_1).*(@d_zi(ϕ_2)./dx .-@D_4ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@d_zi(ϕ_1)./dx .-@D_4ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@d_zi(ϕ_4)./dx .-@D_4ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@d_zi(ϕ_3)./dx .+@D_4ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))).-
        @d_zi(Σ))

    ##Need to drop these and just not bother evolving these. So no need
    ##to declare in the first place
    @inn(Γ_1_n) = @inn(Γ_1_n).+dt.*@inn(Γ_1)
    @inn(Γ_2_n) = @inn(Γ_2_n).+dt.*@inn(Γ_2)
    @inn(Γ_3_n) = @inn(Γ_3_n).+dt.*@inn(Γ_3)
    @inn(Σ_n) = @inn(Σ).+dt.*@inn(Σ)

    return
end

@parallel function leaforward_dot!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n,
    gw,gy,gp2,lambda,vev,dx,dt)
    
    # @inn(test_arr) = @inn(dϕ_1_dt).+gw*@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    # W_1_1,W_1_2,W_1_3,W_1_4,
    # W_2_1,W_2_2,W_2_3,W_2_4,
    # W_3_1,W_3_2,W_3_3,W_3_4,
    # Y_1,Y_2,Y_3,Y_4)
    
    ##swapping namespaces when compared to evolve
    ##data input: _n is input from previous step
    ##without is the information from average half step

    #The expressions below calculate fluxes from the fields at half step
    #and assign to global _n arrays which is is non-_n arrays in this function

    # s[1]=
    @inn(dϕ_1_dt_n) =@inn(dϕ_1_dt_n).+dt.*@inn(dϕ_1_dt)
    # s[2]=
    @inn(dϕ_2_dt_n) =@inn(dϕ_2_dt_n).+dt.*@inn(dϕ_2_dt)
    # s[3]=
    @inn(dϕ_3_dt_n) =@inn(dϕ_3_dt_n).+dt.*@inn(dϕ_3_dt)
    # s[4]=
    @inn(dϕ_4_dt) =@inn(dϕ_4_dt_n).+dt.*@inn(dϕ_4_dt)
    # c
    # c Eq. (2.11) of Baumgarte&Shapiro is $\partial_t A_i = -E_i -...$ so 
    # c we are taking fd(...)=+\partial_t A_i = -E_i (note the sign).
    # s[5]=0.
    # s[6]=
    @inn(dW_1_2_dt_n) =@inn(dW_1_2_dt_n).+dt.*(@inn(dW_1_2_dt).+
    # c in the gauge $W^a_0=0=Y_0$, f(5...)=0=f(9...)=f(13...) and the line
    # c below vanishes.
        @d_xi(W_1_1)./dx .-gw.*(@inn(W_2_1).*@inn(W_3_2).-@inn(W_3_1).*@inn(W_2_2)))
    # s[7]=
    @inn(dW_1_3_dt_n) =@inn(dW_1_3_dt_n).+dt.*(@inn(dW_1_3_dt).+
        @d_yi(W_1_1)./dx.-gw.*(@inn(W_2_1).*@inn(W_3_3).-@inn(W_3_1).*@inn(W_2_3)))
    # s[8]=
    @inn(dW_1_4_dt_n) =@inn(dW_1_4_dt_n).+dt.*(@inn(dW_1_4_dt).+
        @d_zi(W_1_1)./dx.-gw.*(@inn(W_2_1).*@inn(W_3_4).-@inn(W_3_1).*@inn(W_2_4)))

    # s[9]=0.
    # s[10]=
    @inn(dW_2_2_dt_n) =@inn(dW_2_2_dt_n).+dt.*(@inn(dW_2_2_dt).+
        @d_xi(W_2_1)./dx.-gw.*(@inn(W_3_1).*@inn(W_1_2).-@inn(W_1_1).*@inn(W_3_2)))
    # s[11]=
    @inn(dW_2_3_dt_n) =@inn(dW_2_3_dt_n).+dt.*(@inn(dW_2_3_dt).+
        @d_yi(W_2_1)./dx.-gw.*(@inn(W_3_1).*@inn(W_1_3).-@inn(W_1_1).*@inn(W_3_3)))
    # s[12]=
    @inn(dW_2_4_dt_n) =@inn(dW_2_4_dt_n).+dt.*(@inn(dW_2_4_dt).+
        @d_zi(W_2_1)./dx.-gw.*(@inn(W_3_1).*@inn(W_1_4).-@inn(W_1_1).*@inn(W_3_4)))

    # s[13]=0.
    # s[14]=
    @inn(dW_3_2_dt_n) =@inn(dW_3_2_dt_n).+dt.*(@inn(dW_3_2_dt).+
        @d_xi(W_3_1)./dx.-gw.*(@inn(W_1_1).*@inn(W_2_2).-@inn(W_2_1).*@inn(W_1_2)))
    # s[15]=
    @inn(dW_3_3_dt_n) =@inn(dW_3_3_dt_n).+dt.*(@inn(dW_3_3_dt).+
        @d_yi(W_3_1)./dx.-gw.*(@inn(W_1_1).*@inn(W_2_3).-@inn(W_2_1).*@inn(W_1_3)))
    # s[16]=
    @inn(dW_3_4_dt_n) =@inn(dW_3_4_dt_n).+dt.*(@inn(dW_3_4_dt).+
        @d_zi(W_3_1)./dx.-gw.*(@inn(W_1_1).*@inn(W_2_4).-@inn(W_2_1).*@inn(W_1_4)))

    # s[17]=0.
    # s[18]=
    @inn(dY_2_dt_n) =@inn(dY_2_dt).+dt.*(@inn(dY_2_dt).+@d_xi(Y_1)./dx)
    # s[19]=
    @inn(dY_3_dt_n) =@inn(dY_3_dt).+dt.*(@inn(dY_3_dt).+@d_yi(Y_1)./dx)
    # s[20]=
    @inn(dY_4_dt_n) =@inn(dY_4_dt).+dt.*(@inn(dY_4_dt).+@d_zi(Y_1)./dx)

    # c fluxes for gauge functions:
    # cc if on boundaries:
    # c      if(abs(i).eq.latx.or.abs(j).eq.laty.or.abs(k).eq.latz) then
    # cc radial unit vector:
    # c        px=dfloat(i)/sqrt(dfloat(i**2+j**2+k**2))
    # c        py=dfloat(j)/sqrt(dfloat(i**2+j**2+k**2))
    # c        pz=dfloat(k)/sqrt(dfloat(i**2+j**2+k**2))
    # cc
    # c       s(21)=-(px*dfdx(21)+py*dfdy(21)+pz*dfdz(21))
    # c       s(22)=-(px*dfdx(22)+py*dfdy(22)+pz*dfdz(22))
    # c       s(23)=-(px*dfdx(23)+py*dfdy(23)+pz*dfdz(23))
    # c       s(24)=-(px*dfdx(24)+py*dfdy(24)+pz*dfdz(24))
    # c
    # cc if not on boundaries:
    # c      else
    # c
    # s(Γ_1)=
    @inn(dΓ_1_dt_n) =@inn(dΓ_1_dt_n).+dt.*((1.0.-gp2).*(@d2_xi(W_1_2)./(dx*dx) .+@d2_yi(W_1_3)./(dx*dx) .+@d2_zi(W_1_4)./(dx*dx)).+
        gp2.*gw.*(
        -(@inn(W_2_2).*@inn(dW_3_2_dt).-
        @inn(W_3_2).*@inn(dW_2_2_dt)).-
        (@inn(W_2_3).*@inn(dW_3_3_dt).-
        @inn(W_3_3).*@inn(dW_2_3_dt)).-
        (@inn(W_2_4).*@inn(dW_3_4_dt).-
        @inn(W_3_4).*@inn(dW_2_4_dt))).+
    # c charge from Higgs: 
        gp2.*gw.*(@inn(ϕ_1).*(@inn(dϕ_4_dt) .-@D_1ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@inn(dϕ_1_dt) .-@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@inn(dϕ_2_dt) .-@D_1ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@inn(dϕ_3_dt) .-@D_1ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))))

    # s(Γ_2)=
    @inn(dΓ_2_dt_n) =@inn(dΓ_2_dt_n).+dt.*((1.0.-gp2).*(@d2_xi(W_2_2)./(dx*dx) .+@d2_yi(W_2_3)./(dx*dx) .+@d2_zi(W_2_4)./(dx*dx)).+
        gp2 .*gw.*(
        -(@inn(W_3_2).*@inn(dW_1_2_dt).-
        @inn(W_1_2).*@inn(dW_3_2_dt)).-
        (@inn(W_3_3).*@inn(dW_1_3_dt).-
        @inn(W_1_3).*@inn(dW_3_3_dt)).-
        (@inn(W_3_4).*@inn(dW_1_4_dt).-
        @inn(W_1_4).*@inn(dW_3_4_dt))).+
    # c charge from Higgs: 
        gp2 .*gw.*(@inn(ϕ_3).*(@inn(dϕ_1_dt) .-@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_1).*(@inn(dϕ_3_dt) .-@D_1ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@inn(dϕ_2_dt) .-@D_1ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@inn(dϕ_4_dt) .-@D_1ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))))

    # s(Γ_3)=
    @inn(dΓ_3_dt_n) =@inn(dΓ_3_dt_n).+dt.*((1.0.-gp2).*(@d2_xi(W_3_2)./(dx*dx) .+@d2_yi(W_3_3)./(dx*dx) .+@d2_zi(W_3_4)./(dx*dx)).+
        gp2 .*gw.*(
        -(@inn(W_1_2).*@inn(dW_2_2_dt).-
        @inn(W_2_2).*@inn(dW_1_2_dt)).-
        (@inn(W_1_3).*@inn(dW_2_3_dt).-
        @inn(W_2_3).*@inn(dW_1_3_dt)).-
        (@inn(W_1_4).*@inn(dW_2_4_dt).-
        @inn(W_2_4).*@inn(dW_1_4_dt))).+
    # c current from Higgs: 
        gp2 .*gw.*(@inn(ϕ_1).*(@inn(dϕ_2_dt) .-@D_1ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@inn(dϕ_1_dt) .-@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_4).*(@inn(dϕ_3_dt) .-@D_1ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_3).*(@inn(dϕ_4_dt) .-@D_1ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))))

    # s(Σ)=
    @inn(dΣ_dt_n) =@inn(dΣ_dt_n).+dt.*((1.0.-gp2).*(@d2_xi(Y_2)./(dx*dx) .+@d2_yi(Y_3)./(dx*dx) .+@d2_zi(Y_4)./(dx*dx)).+
    # c current from Higgs: 
        gp2 .*gy.*(@inn(ϕ_1)*(@inn(dϕ_2_dt) .-@D_1ϕ_2(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_2).*(@inn(dϕ_1_dt) .-@D_1ϕ_1(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).+
        @inn(ϕ_3).*(@inn(dϕ_4_dt) .-@D_1ϕ_4(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4)).-
        @inn(ϕ_4).*(@inn(dϕ_3_dt) .-@D_1ϕ_3(ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4))))

    return
end

@parallel_indices (ix,iy,iz) function initializer!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,ib,jb,kb,p1,p2,p3,p4,rk,dx,mH)
    rb = (1.0/rk)*sqrt(sin(rk*((ix-1)-(ib-0.5))*dx)^2+sin(rk*((iy-1)-(jb-0.5))*dx)^2+sin(rk*((iz-1)-(kb-0.5))*dx)^2)
    rmag = (1.0+(sqrt(2.0)-1.0)^2)*exp(-mH*rb/sqrt(2.0))/(1.0+((sqrt(2.0)-1.0)^2)*exp(-sqrt(2.0)*mH*rb))
    ϕ_1[ix,iy,iz]=ϕ_1[ix,iy,iz]+rmag*p1
    ϕ_2[ix,iy,iz]=ϕ_2[ix,iy,iz]+rmag*p2
    ϕ_3[ix,iy,iz]=ϕ_3[ix,iy,iz]+rmag*p3
    ϕ_4[ix,iy,iz]=ϕ_4[ix,iy,iz]+rmag*p4
    return
end

@parallel function renormalize!(ϕ_1,ϕ_2,ϕ_3,ϕ_4)
    @all(ϕ_1)=@all(ϕ_1)/(sqrt(@all(ϕ_1)*@all(ϕ_1)+@all(ϕ_2)*@all(ϕ_2)+@all(ϕ_3)*@all(ϕ_3)+@all(ϕ_4)*@all(ϕ_4)))
    @all(ϕ_2)=@all(ϕ_2)/(sqrt(@all(ϕ_1)*@all(ϕ_1)+@all(ϕ_2)*@all(ϕ_2)+@all(ϕ_3)*@all(ϕ_3)+@all(ϕ_4)*@all(ϕ_4)))
    @all(ϕ_3)=@all(ϕ_3)/(sqrt(@all(ϕ_1)*@all(ϕ_1)+@all(ϕ_2)*@all(ϕ_2)+@all(ϕ_3)*@all(ϕ_3)+@all(ϕ_4)*@all(ϕ_4)))
    @all(ϕ_4)=@all(ϕ_4)/(sqrt(@all(ϕ_1)*@all(ϕ_1)+@all(ϕ_2)*@all(ϕ_2)+@all(ϕ_3)*@all(ϕ_3)+@all(ϕ_4)*@all(ϕ_4)))
    return
end

function run_ev()

# Numerics
nx, ny, nz = latx,laty,latz;                              # Number of gridpoints dimensions x, y and z.

me,dims = init_global_grid(nx, ny, nz; periodx=1, periody=1, periodz=1);
println("Device: ", me)
# println(device())

# Array initializations
ϕ_1 = @zeros(nx,ny,nz)
ϕ_2 = @zeros(nx,ny,nz)
ϕ_3 = @zeros(nx,ny,nz)
ϕ_4 = @zeros(nx,ny,nz)
W_1_1 = @zeros(nx,ny,nz)
W_1_2 = @zeros(nx,ny,nz)
W_1_3 = @zeros(nx,ny,nz)
W_1_4 = @zeros(nx,ny,nz)
W_2_1 = @zeros(nx,ny,nz)
W_2_2 = @zeros(nx,ny,nz)
W_2_3 = @zeros(nx,ny,nz)
W_2_4 = @zeros(nx,ny,nz)
W_3_1 = @zeros(nx,ny,nz)
W_3_2 = @zeros(nx,ny,nz)
W_3_3 = @zeros(nx,ny,nz)
W_3_4 = @zeros(nx,ny,nz)
Y_1 = @zeros(nx,ny,nz)
Y_2 = @zeros(nx,ny,nz)
Y_3 = @zeros(nx,ny,nz)
Y_4 = @zeros(nx,ny,nz)
Γ_1 = @zeros(nx,ny,nz)
Γ_2 = @zeros(nx,ny,nz)
Γ_3 = @zeros(nx,ny,nz)
Σ = @zeros(nx,ny,nz)

dϕ_1_dt = @zeros(nx,ny,nz)
dϕ_2_dt = @zeros(nx,ny,nz)
dϕ_3_dt = @zeros(nx,ny,nz)
dϕ_4_dt = @zeros(nx,ny,nz)
dW_1_1_dt = @zeros(nx,ny,nz)
dW_1_2_dt = @zeros(nx,ny,nz)
dW_1_3_dt = @zeros(nx,ny,nz)
dW_1_4_dt = @zeros(nx,ny,nz)
dW_2_1_dt = @zeros(nx,ny,nz)
dW_2_2_dt = @zeros(nx,ny,nz)
dW_2_3_dt = @zeros(nx,ny,nz)
dW_2_4_dt = @zeros(nx,ny,nz)
dW_3_1_dt = @zeros(nx,ny,nz)
dW_3_2_dt = @zeros(nx,ny,nz)
dW_3_3_dt = @zeros(nx,ny,nz)
dW_3_4_dt = @zeros(nx,ny,nz)
dY_1_dt = @zeros(nx,ny,nz)
dY_2_dt = @zeros(nx,ny,nz)
dY_3_dt = @zeros(nx,ny,nz)
dY_4_dt = @zeros(nx,ny,nz)
dΓ_1_dt = @zeros(nx,ny,nz)
dΓ_2_dt = @zeros(nx,ny,nz)
dΓ_3_dt = @zeros(nx,ny,nz)
dΣ_dt = @zeros(nx,ny,nz)

# Array initializations
ϕ_1_n = @zeros(nx,ny,nz)
ϕ_2_n = @zeros(nx,ny,nz)
ϕ_3_n = @zeros(nx,ny,nz)
ϕ_4_n = @zeros(nx,ny,nz)
W_1_1_n = @zeros(nx,ny,nz)
W_1_2_n = @zeros(nx,ny,nz)
W_1_3_n = @zeros(nx,ny,nz)
W_1_4_n = @zeros(nx,ny,nz)
W_2_1_n = @zeros(nx,ny,nz)
W_2_2_n = @zeros(nx,ny,nz)
W_2_3_n = @zeros(nx,ny,nz)
W_2_4_n = @zeros(nx,ny,nz)
W_3_1_n = @zeros(nx,ny,nz)
W_3_2_n = @zeros(nx,ny,nz)
W_3_3_n = @zeros(nx,ny,nz)
W_3_4_n = @zeros(nx,ny,nz)
Y_1_n = @zeros(nx,ny,nz)
Y_2_n = @zeros(nx,ny,nz)
Y_3_n = @zeros(nx,ny,nz)
Y_4_n = @zeros(nx,ny,nz)
Γ_1_n = @zeros(nx,ny,nz)
Γ_2_n = @zeros(nx,ny,nz)
Γ_3_n = @zeros(nx,ny,nz)
Σ_n = @zeros(nx,ny,nz)

dϕ_1_dt_n = @zeros(nx,ny,nz)
dϕ_2_dt_n = @zeros(nx,ny,nz)
dϕ_3_dt_n = @zeros(nx,ny,nz)
dϕ_4_dt_n = @zeros(nx,ny,nz)
dW_1_1_dt_n = @zeros(nx,ny,nz)
dW_1_2_dt_n = @zeros(nx,ny,nz)
dW_1_3_dt_n = @zeros(nx,ny,nz)
dW_1_4_dt_n = @zeros(nx,ny,nz)
dW_2_1_dt_n = @zeros(nx,ny,nz)
dW_2_2_dt_n = @zeros(nx,ny,nz)
dW_2_3_dt_n = @zeros(nx,ny,nz)
dW_2_4_dt_n = @zeros(nx,ny,nz)
dW_3_1_dt_n = @zeros(nx,ny,nz)
dW_3_2_dt_n = @zeros(nx,ny,nz)
dW_3_3_dt_n = @zeros(nx,ny,nz)
dW_3_4_dt_n = @zeros(nx,ny,nz)
dY_1_dt_n = @zeros(nx,ny,nz)
dY_2_dt_n = @zeros(nx,ny,nz)
dY_3_dt_n = @zeros(nx,ny,nz)
dY_4_dt_n = @zeros(nx,ny,nz)
dΓ_1_dt_n = @zeros(nx,ny,nz)
dΓ_2_dt_n = @zeros(nx,ny,nz)
dΓ_3_dt_n = @zeros(nx,ny,nz)
dΣ_dt_n = @zeros(nx,ny,nz)

# f=[ϕ_1,ϕ_2,ϕ_3,ϕ_4,W_1_1,W_1_2,W_1_3,W_1_4,W_2_1,W_2_2,W_2_3,W_2_4,W_3_1,W_3_2,W_3_3,W_3_4,Y_1,Y_2,Y_3,Y_4,Γ_1,Γ_2,Γ_3,Σ]
# fd=[dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
# dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,
# dW_1_4_dt,dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
# dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
# dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
# dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt]

# f_n=[ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,Y_1_n,Y_2_n,Y_3_n,Y_4_n,Γ_1_n,Γ_2_n,Γ_3_n,Σ_n]
# fd_n=[dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
# dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,
# dW_1_4_dt_n,dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
# dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
# dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
# dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n]

# test_arr = @zeros(nx,ny,nz)

# ϕ_1 = Data.Array(phi_arr[:,:,:,1])
# ϕ_2 = Data.Array(phi_arr[:,:,:,2])
# ϕ_3 = Data.Array(phi_arr[:,:,:,3])
# ϕ_4 = Data.Array(phi_arr[:,:,:,4])

# ϕ_1_n=ϕ_1
# ϕ_2_n=ϕ_2
# ϕ_3_n=ϕ_3
# ϕ_4_n=ϕ_4

# phi_arr= zeros((latx,laty,latz,4))
# @time phi_arr = bubbler(phi_arr)
# ϕ_1 .= Data.Array(phi_arr[:,:,:,1])
# ϕ_2 .= Data.Array(phi_arr[:,:,:,2])
# ϕ_3 .= Data.Array(phi_arr[:,:,:,3])
# ϕ_4 .= Data.Array(phi_arr[:,:,:,4])

bubs = []
for kb in range(bub_diam,stop=latz,step=bub_diam)
    for jb in range(bub_diam,stop=laty,step=bub_diam)
        for ib in range(bub_diam,stop=latx,step=bub_diam)
            phi=gen_phi()
            push!(bubs,[ib,jb,kb,real(phi[1]),imag(phi[1]),real(phi[2]),imag(phi[2])])
        end
    end
end

println("# bubbles: ",size(bubs,1))
Len = (latx-1)*dx
rk = pi/Len

@time for b in range(1,size(bubs,1),step=1)
    ib,jb,kb,p1,p2,p3,p4 = bubs[b]
    @parallel (1:nx,1:ny,1:nz) initializer!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,ib,jb,kb,p1,p2,p3,p4,rk,dx,mH)
end

# @parallel renormalize!(ϕ_1,ϕ_2,ϕ_3,ϕ_4)

ϕ_1_n.=ϕ_1
ϕ_2_n.=ϕ_2
ϕ_3_n.=ϕ_3
ϕ_4_n.=ϕ_4

x=z=range(1,latx,step=1)
gr()
ENV["GKSwstype"]="nul"


anim = Animation();
nx_v = (nx-2)*dims[1];
ny_v = (ny-2)*dims[2];
nz_v = (nz-2)*dims[3];
T_v  = zeros(nx_v, ny_v, nz_v);
T_nohalo = zeros(nx-2, ny-2, nz-2);

p1=contourf(z,x,(Array(ϕ_1)[:,ny÷2,:].*Array(ϕ_1)[:,ny÷2,:].+Array(ϕ_2)[:,ny÷2,:].*Array(ϕ_2)[:,ny÷2,:].+Array(ϕ_3)[:,ny÷2,:].*Array(ϕ_3)[:,ny÷2,:].+Array(ϕ_4)[:,ny÷2,:].*Array(ϕ_4)[:,ny÷2,:]))
# p1=contourf(z,x,Array(ϕ_1)[:,ny÷2,:])
p2=contourf(z,x,Array(ϕ_2)[:,ny÷2,:])
p3=contourf(z,x,Array(ϕ_3)[:,ny÷2,:])
p4=contourf(z,x,Array(ϕ_4)[:,ny÷2,:])

plot(p1,p2,p3,p4,layout=4)
png(string("testini1",".png"))
# exit()

npzwrite(string("raw_",0),Float32.(Array(ϕ_1).*Array(ϕ_1).+Array(ϕ_2).*Array(ϕ_2).+Array(ϕ_3).*Array(ϕ_3).+Array(ϕ_4).*Array(ϕ_4)))

println("Initialized")
for i in range(1,nt,step=1)

    # if (me==0) contourf(transpose(T_v[:,ny_v÷2,:]), aspect_ratio=1); frame(anim); end
    # if mod(i,1)==0
    #     T_nohalo .=Array(ϕ_1[2:end-1,2:end-1,2:end-1])
    #     gather!(T_nohalo,T_v)
    #     if (me==0)
    #         p1=contourf(T_v[:,bub_diam,:])
    #     end
    #     T_nohalo .=Array(ϕ_2[2:end-1,2:end-1,2:end-1])
    #     gather!(T_nohalo,T_v)
    #     if (me==0)
    #         p2=contourf(T_v[:,bub_diam,:])
    #     end

    #     T_nohalo .=Array(ϕ_3[2:end-1,2:end-1,2:end-1])
    #     gather!(T_nohalo,T_v)
    #     if (me==0)
    #         p3=contourf(T_v[:,bub_diam,:])
    #     end

    #     T_nohalo .=Array(ϕ_4[2:end-1,2:end-1,2:end-1])
    #     gather!(T_nohalo,T_v)
    #     if (me==0)
    #         p4=contourf(T_v[:,bub_diam,:])
    #     end

    #     if (me==0)
    #         plot(p1,p2,p3,p4,layout=4);
    #         png(string("test",i,".png"));
    #         frame(anim)
    #     end
    # end

    if mod(i,10)==0
        if (me==0)
            # p1=contourf(sqrt(ϕ_1[:,bub_diam,:]*ϕ_1[:,bub_diam,:]+ϕ_2[:,bub_diam,:]*ϕ_2[:,bub_diam,:]+ϕ_3[:,bub_diam,:]*ϕ_3[:,bub_diam,:]+ϕ_4[:,bub_diam,:]*ϕ_4[:,bub_diam,:]))
            # p1=contourf(ϕ_1[:,bub_diam,:])
            # p2=contourf(ϕ_2[:,bub_diam,:])
            # p3=contourf(ϕ_3[:,bub_diam,:])
            # p4=contourf(ϕ_4[:,bub_diam,:])
            p1=contourf(z,x,(Array(ϕ_1)[:,ny÷2,:].*Array(ϕ_1)[:,ny÷2,:].+Array(ϕ_2)[:,ny÷2,:].*Array(ϕ_2)[:,ny÷2,:].+Array(ϕ_3)[:,ny÷2,:].*Array(ϕ_3)[:,ny÷2,:].+Array(ϕ_4)[:,ny÷2,:].*Array(ϕ_4)[:,ny÷2,:]))
            # p1=contourf(z,x,Array(ϕ_1)[:,ny÷2,:])
            p2=contourf(z,x,Array(ϕ_2)[:,ny÷2,:])
            p3=contourf(z,x,Array(ϕ_3)[:,ny÷2,:])
            p4=contourf(z,x,Array(ϕ_4)[:,ny÷2,:])
            plot(p1,p2,p3,p4,layout=4);
            # png(string("test",i,".png"));
            frame(anim)
        end
    end

    #Write raw data
    if mod(i,25)==0
        if (me==0)
            npzwrite(string("raw_",i),Float32.(Array(ϕ_1).*Array(ϕ_1).+Array(ϕ_2).*Array(ϕ_2).+Array(ϕ_3).*Array(ϕ_3).+Array(ϕ_4).*Array(ϕ_4)))
        end
    end

    # @parallel evolve!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    # W_1_1,W_1_2,W_1_3,W_1_4,
    # W_2_1,W_2_2,W_2_3,W_2_4,
    # W_3_1,W_3_2,W_3_3,W_3_4,
    # Y_1,Y_2,Y_3,Y_4,
    # Γ_1,Γ_2,Γ_3,Σ,
    # dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    # dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    # dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    # dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    # dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    # dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    # ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    # W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    # W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    # W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    # Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    # Γ_1_n,Γ_2_n,Γ_3_n,Σ_n,
    # dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    # dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    # dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    # dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    # dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    # dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n,
    # gw,gy,gp2,lambda,vev,dx,dt)
    
    @parallel evolve!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    Γ_1_n,Γ_2_n,Γ_3_n,Σ_n,
    gw,gy,gp2,lambda,vev,dx,dt)

    @parallel evolve_dot!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n,
    gw,gy,gp2,lambda,vev,dx,dt)

    @parallel avg_half_step!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    Γ_1_n,Γ_2_n,Γ_3_n,Σ_n)

    @parallel avg_half_step_dot!(dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n)

    @parallel leaforward!(ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    Γ_1_n,Γ_2_n,Γ_3_n,Σ_n,
    dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    gw,gy,gp2,lambda,vev,dx,dt)

    @parallel leaforward_dot!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n,
    dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    gw,gy,gp2,lambda,vev,dx,dt)
    
    @parallel avg_half_step!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    Γ_1_n,Γ_2_n,Γ_3_n,Σ_n)

    @parallel avg_half_step_dot!(dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n)

    @parallel leaforward!(ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    Γ_1_n,Γ_2_n,Γ_3_n,Σ_n,
    dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    gw,gy,gp2,lambda,vev,dx,dt)

    @parallel leaforward_dot!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n,
    dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt,
    gw,gy,gp2,lambda,vev,dx,dt)

    # update_halo!(ϕ_1_n)
    # update_halo!(ϕ_2_n)
    # update_halo!(ϕ_3_n)
    # update_halo!(ϕ_4_n)
    # update_halo!(W_1_1_n)
    # update_halo!(W_1_2_n)
    # update_halo!(W_1_3_n)
    # update_halo!(W_1_4_n)
    # update_halo!(W_2_1_n)
    # update_halo!(W_2_2_n)
    # update_halo!(W_2_3_n)
    # update_halo!(W_2_4_n)
    # update_halo!(W_3_1_n)
    # update_halo!(W_3_2_n)
    # update_halo!(W_3_3_n)
    # update_halo!(W_3_4_n)
    # update_halo!(Y_1_n)
    # update_halo!(Y_2_n)
    # update_halo!(Y_3_n)
    # update_halo!(Y_4_n)
    # update_halo!(dϕ_1_dt_n)
    # update_halo!(dϕ_2_dt_n)
    # update_halo!(dϕ_3_dt_n)
    # update_halo!(dϕ_4_dt_n)
    # update_halo!(dW_1_1_dt_n)
    # update_halo!(dW_1_2_dt_n)
    # update_halo!(dW_1_3_dt_n)
    # update_halo!(dW_1_4_dt_n)
    # update_halo!(dW_2_1_dt_n)
    # update_halo!(dW_2_2_dt_n)
    # update_halo!(dW_2_3_dt_n)
    # update_halo!(dW_2_4_dt_n)
    # update_halo!(dW_3_1_dt_n)
    # update_halo!(dW_3_2_dt_n)
    # update_halo!(dW_3_3_dt_n)
    # update_halo!(dW_3_4_dt_n)
    # update_halo!(dY_1_dt_n)
    # update_halo!(dY_2_dt_n)
    # update_halo!(dY_3_dt_n)
    # update_halo!(dY_4_dt_n)

    update_halo!(ϕ_1,ϕ_2,ϕ_3,ϕ_4,
    W_1_1,W_1_2,W_1_3,W_1_4,
    W_2_1,W_2_2,W_2_3,W_2_4,
    W_3_1,W_3_2,W_3_3,W_3_4,
    Y_1,Y_2,Y_3,Y_4,
    Γ_1,Γ_2,Γ_3,Σ,
    dϕ_1_dt,dϕ_2_dt,dϕ_3_dt,dϕ_4_dt,
    dW_1_1_dt,dW_1_2_dt,dW_1_3_dt,dW_1_4_dt,
    dW_2_1_dt,dW_2_2_dt,dW_2_3_dt,dW_2_4_dt,
    dW_3_1_dt,dW_3_2_dt,dW_3_3_dt,dW_3_4_dt,
    dY_1_dt,dY_2_dt,dY_3_dt,dY_4_dt,
    dΓ_1_dt,dΓ_2_dt,dΓ_3_dt,dΣ_dt)

    update_halo!(ϕ_1_n,ϕ_2_n,ϕ_3_n,ϕ_4_n,
    W_1_1_n,W_1_2_n,W_1_3_n,W_1_4_n,
    W_2_1_n,W_2_2_n,W_2_3_n,W_2_4_n,
    W_3_1_n,W_3_2_n,W_3_3_n,W_3_4_n,
    Y_1_n,Y_2_n,Y_3_n,Y_4_n,
    Γ_1_n,Γ_2_n,Γ_3_n,Σ_n,
    dϕ_1_dt_n,dϕ_2_dt_n,dϕ_3_dt_n,dϕ_4_dt_n,
    dW_1_1_dt_n,dW_1_2_dt_n,dW_1_3_dt_n,dW_1_4_dt_n,
    dW_2_1_dt_n,dW_2_2_dt_n,dW_2_3_dt_n,dW_2_4_dt_n,
    dW_3_1_dt_n,dW_3_2_dt_n,dW_3_3_dt_n,dW_3_4_dt_n,
    dY_1_dt_n,dY_2_dt_n,dY_3_dt_n,dY_4_dt_n,
    dΓ_1_dt_n,dΓ_2_dt_n,dΓ_3_dt_n,dΣ_dt_n)

    ϕ_1,ϕ_1_n=ϕ_1_n,ϕ_1
    ϕ_2,ϕ_2_n=ϕ_2_n,ϕ_2
    ϕ_3,ϕ_3_n=ϕ_3_n,ϕ_3
    ϕ_4,ϕ_4_n=ϕ_4_n,ϕ_4
    W_1_1,W_1_1_n=W_1_1_n,W_1_1
    W_1_2,W_1_2_n=W_1_2_n,W_1_2
    W_1_3,W_1_3_n=W_1_3_n,W_1_3
    W_1_4,W_1_4_n=W_1_4_n,W_1_4
    W_2_1,W_2_1_n=W_2_1_n,W_2_1
    W_2_2,W_2_2_n=W_2_2_n,W_2_2
    W_2_3,W_2_3_n=W_2_3_n,W_2_3
    W_2_4,W_2_4_n=W_2_4_n,W_2_4
    W_3_1,W_3_1_n=W_3_1_n,W_3_1
    W_3_2,W_3_2_n=W_3_2_n,W_3_2
    W_3_3,W_3_3_n=W_3_3_n,W_3_3
    W_3_4,W_3_4_n=W_3_4_n,W_3_4
    Y_1,Y_1_n,Y_1_n,Y_1
    Y_2,Y_2_n,Y_2_n,Y_2
    Y_3,Y_3_n,Y_3_n,Y_3
    Y_4,Y_4_n,Y_4_n,Y_4
    dϕ_1_dt,dϕ_1_dt_n=dϕ_1_dt_n,dϕ_1_dt
    dϕ_2_dt,dϕ_2_dt_n=dϕ_2_dt_n,dϕ_2_dt
    dϕ_3_dt,dϕ_3_dt_n=dϕ_3_dt_n,dϕ_3_dt
    dϕ_4_dt,dϕ_4_dt_n=dϕ_4_dt_n,dϕ_4_dt
    dW_1_1_dt,dW_1_1_dt_n=dW_1_1_dt_n,dW_1_1_dt
    dW_1_2_dt,dW_1_2_dt_n=dW_1_2_dt_n,dW_1_2_dt
    dW_1_3_dt,dW_1_3_dt_n=dW_1_3_dt_n,dW_1_3_dt
    dW_1_4_dt,dW_1_4_dt_n=dW_1_4_dt_n,dW_1_4_dt
    dW_2_1_dt,dW_2_1_dt_n=dW_2_1_dt_n,dW_2_1_dt
    dW_2_2_dt,dW_2_2_dt_n=dW_2_2_dt_n,dW_2_2_dt
    dW_2_3_dt,dW_2_3_dt_n=dW_2_3_dt_n,dW_2_3_dt
    dW_2_4_dt,dW_2_4_dt_n=dW_2_4_dt_n,dW_2_4_dt
    dW_3_1_dt,dW_3_1_dt_n=dW_3_1_dt_n,dW_3_1_dt
    dW_3_2_dt,dW_3_2_dt_n=dW_3_2_dt_n,dW_3_2_dt
    dW_3_3_dt,dW_3_3_dt_n=dW_3_3_dt_n,dW_3_3_dt
    dW_3_4_dt,dW_3_4_dt_n=dW_3_4_dt_n,dW_3_4_dt
    dY_1_dt,dY_1_dt_n,dY_1_dt_n,dY_1_dt
    dY_2_dt,dY_2_dt_n,dY_2_dt_n,dY_2_dt
    dY_3_dt,dY_3_dt_n,dY_3_dt_n,dY_3_dt
    dY_4_dt,dY_4_dt_n,dY_4_dt_n,dY_4_dt

end

if (me==0) gif(anim, "EW3d_test.gif", fps = 10) end

finalize_global_grid();
end

@time run_ev()
